{
  "outputValue": [
    {
      "postInfo": {
        "title": "Logitech MX Keys vs. Apple Magic Keyboard",
        "content": "tl;dr: I hemmed, I hawed, I kept the Logitech. Don't be fooled by the floor model at Best Buy.\n\nI'm posting this because I feel like most of the comparisons focus on the features and not the typing experience, which is what matters most. According to [monkeytype.com](https://monkeytype.com), I type 140wpm, so I'm tuned into whether keyboards slow me down. I am a writer, not a gamer, so I wanted something that would be easy on the fingers and boost productivity.\n\nI narrowed my choice down between the Logitech MX keys and the Apple Magic Keyboard. My primary concern was typing feel, with any features being a secondary consideration. However, I use both Apple and Linux computers equally, so the ability to go between the two was leaning me toward the Logitech.\n\nI originally went to a Best Buy to try them out, and I was appalled by the feel of the Logitech they had on display. It felt horribly cheap compared to the Magic Keyboard.\n\nI have been using the Magic Keyboard (tenkeyless version) since I got it in the mail last week. I like it a lot. It's small, really slick, and super lightweight. Really, it's great. I found one YouTube video of a fast typist comparing these two 'boards, and loves the Magic Keyboard. The low travel took some getting used to, but it's actually really nice on the fingers, and I suspect I could increase my speed if I really practiced with it. One thing I couldn't get over, however, is that the right end of the keyboard feels really abrupt to me (coming from a full-sized keyboard). My right pinky was actually flying off the board at first. Another gripe is that the caps lock key was not very accurate and needed a direct or double press to activate. However, I was overall really satisfied with the Magic Keyboard and had made up my mind to keep it.\n\nBUT THEN, I got the Logitech in the mail today, and I was flummoxed: It feels totally different from what was on display in the store. The only thing I can think is that the show model at Best Buy was a fake replica (it wasn't hooked up to a computer). In reality, this keyboard is very heavy, which I consider a plus. Truth be told, the typing feel isn't as \"magical\" as the Magic Keyboard. When I did a typing speed test, however, I was surprised to find that I am nominally faster on the MX Keys. So, the feel comparison is a wash, in my opinion.\n\nWith my primary concern resulting in a tie, it fell to the secondary things. Yes, the Apple keyboard is cute. I do prefer a number pad, but I figured I could live without it. What I can't live without, I realized, are the six navigation keys (page up/down, home, end, delete etc.). More than that, the Logitech has quick buttons to switch devices, and it comes with a USB dongle that can work with a Logitech mouse as well. I bought the standard version of the MX Keys, which has BOTH the Mac and PC keymappings drawn on side-by-side—a huge win for me. The MX Keys is plastic, but the whole unit is way heavier than the Magic Keyboard (which I like, you may not). Combined with Logitech's great student discount, all of these conveniences made me willing to give up the aesthetics and slightly lighter typing experience of the Magic Keyboard.\n\nIf you're trying to make the same decision, I hope this is helpful.\n\nFive-month update for posterity's sake: I miss the Magic Keyboard. I've been using the MX Keyboard eight hours per day for the last five months. I like it. It feels really solid, and the ability to connect up to three devices is slick. But from a pure typing standpoint, I can tell that there's something about the key travel that's both hurting my fingers and maxing out my typing speed at 120wpm. I'll probably keep it as a carry around keyboard, or for when I absolutely need something with a number pad, but I'm planning to switch back to an Apple keyboard.",
        "author": "[deleted]",
        "score": 30,
        "comments": [
          {
            "author": "Chamezz92",
            "body": "I have been a life long user of Logitech, but their recent products are definitely not the same quality that I remember.\n\nThe Logi Options on Mac M1 runs terrible as well. It constantly changes my keyboard to use the FN keys as Function keys instead of the normal features like adjusting volume etc. I have to switch this back several times, per day.\n\nFor some reason they lag a lot when running them on Bluetooth, but even with their own unifying adapter. I am running both mouse and keyboard about 30cm away from the USB adapter.\n\nI would not buy any wireless Logitech products, tbh.\n\nHave you had a look at keyboards such as Keychron? They have native mac keys, Bluetooth and USB-C, they come in a variety of layouts, switches and thickness.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "[deleted]",
            "body": "I have a Macbook and a computer I use a magnetic USB to lightning cable for my magic keyboard. \n\n\nWhen plugged in it's connected to the PC, unplugging connects it automatically to the MacBook... It's somewhat like the device switching Logitech have. (And somewhat inconveniently put the button for on the bottom of their mice, first world problem sure... But isn't everything on thisnsub really?)\n\n\n\nBut there's something really neat about the mxkeys auto backlight",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "I'm guessing the model on display was just heavily used so the switches felt different.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "tommyjamesmurphy",
            "body": "Apple's keyboards have accidental CAPS LOCK prevention as a feature. It is setup to activate on slightly longer presses vs a tap, to cancel out accidental presses! So the wonky behaviour you were describing, is actually a feature, for better or worse.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "TonyFloats",
            "body": "MY MX KEYS KEYBOARD JUST BORKE WITHIN LIKE FIVE MONTHS OF USE AND I AM USING IT TYPE THIS COMMENT&gt; AS YOU MAY HAVE NOTICED&lt; THE SHIFT KEY IS BROKEN AND I CANNOT STOP TYPING IN CAPITAL LETTERS&gt; THE BUILD QUALITY IS EXTREMELY DISAPPOINTING FOR SOMETHING THAT IS MORE EXPENSIVE THAN THE APPLE MAIC KEYBOARD HERE IN AUSTRALIA&gt;\n\nDO NOT RECOMMEND :(\n\n&amp;#x200B;\n\nUpdate: just returned my logitech Mx keys and traded with apple magic keyboard. They are very different keyboards indeed. I am currently typing the magic keyboard. Will update soon. \n\n&amp;#x200B;\n\nInitial thoughts: much lighter than the logitech keyboard in both the overall weight and the actuation force of the keyboard. So far, I'd say i like the apple magic keyboard switches more than the logitech keyboard, because the logitech keyboard does feel a bit  too heavy and my finger gets quite tired after typing on them. I must however admit that the build quality of MX keys feel better because of the heavier and sturdier feel.",
            "score": 1,
            "sentiment": "negative"
          }
        ]
      },
      "link": "https://www.reddit.com/r/keyboards/comments/qfp3eb/logitech_mx_keys_vs_apple_magic_keyboard/"
    },
    {
      "postInfo": {
        "title": "Can't decide between Apple magic keyboard or MX keys mini",
        "content": "I'm trying to decide between mx keys mini or magic keyboard with touch id.  I've read multiple reddit comments, and overall majority is leaning towards mx rather than macic keyboard. I like both. They are both nice to type and both have same keyboard layout as my macbook (I wanted to have it identical to not loose typing productivity while travelling)\n\nPros of Apple magic keyboard:\n\n* It's ligher. I can carry it with me together with a macbook and use the same keyboard both at work and at home (I use external display with clamshell mode in both cases).\n* Agter some typing tests I seem to type faster.\n* it somehow looks better\n* it has touch ID\n\nPros of Logitech Mx Keys Mini:  \n+it has backlight (though I don't seem to need it)  \n+it can pair quickly to 3 devices (though I'm using it only with mac)  \n+it uses USB C!  \n+it's almost twice cheaper\n\nThe pros of MX keys mini are strong, but not overweighting because I don't use 2 of them. Thus the ligher weight of apple keyboard is somehow winning.\n\nPlease give me a strong argument in favor of one of them so I could decide with confidence.\n\nThank you!\n\nps. btw the magic trackpad that you see in the picture is going to be returned. With its all comfort and fancy look it's less efficient than a traditional mouse. With mouse I work faster\n\n**Update after 12h:**  \nBig thanks to everybody for the comments, especially the longer comments from those trying both, that gave some comparison and arguments.  \nI use only 1 macbook (both at work and at home) so multiconnect is not needed and I somehow already know all the keys by heart and don't need the backlight.   \nAt the same time many comments stressed the **better quality** of apple magic keyboard, **touch id** and **weight**. The magic keyboard is indeed very light and it's viable to cary it with me to work and back home together with the makbook. The logitech in this case is heavier and bulkier.  \n**So I'll stick with apple magic keyboard. It has more advantages for my use case.**   \n**Big thanks for all the comments and pros/cons. You helped me a lot!**\n\nhttps://preview.redd.it/jltrrzed96kd1.jpg?width=1280&amp;format=pjpg&amp;auto=webp&amp;s=2c0b5688dc88232b74a8205cc4d1e8bcc5c7492c",
        "author": "klukiyan",
        "score": 34,
        "comments": [
          {
            "author": "holdenger",
            "body": "Touch ID is addictive",
            "score": 55,
            "sentiment": "positive"
          },
          {
            "author": "runandbeer",
            "body": "Mx keys mini has multi-device feature. It's helpful in present days when  a person owns many devices such as smartphone, smart tv and tablet.",
            "score": 11,
            "sentiment": "positive"
          },
          {
            "author": "Pyromancer_81",
            "body": "I went for logitech mx cause i use multiple devices windows and mac and I have apple watch so no need for touch ID.",
            "score": 11,
            "sentiment": "neutral"
          },
          {
            "author": "P-51Mustang25",
            "body": "I own both. Using MX Keys on Intel mac mini, and magic keyboard on M1 MBP.\n\nMX keys definitely feels better to type. Keys are designed and printed to multi function on windows and mac so if you are going to use multiple os that’s a plus. Seamless device switching is also very good if you’ll use it on multiple devices. It has backlight, magic keyboard does not.\n\nMX keys is heavier than Magic Keyboard.\n\nThat said, MK has one big advantage that MX does not. Touch ID. Mind you though, Intel Mac does not support it.\n\nOverall I like using MX keys more, but if portability is an issue (it is 2* heavier) and the convenience of touch id is too important to give up, mk is also a good choice.",
            "score": 10,
            "sentiment": "neutral"
          },
          {
            "author": "LeafHubble",
            "body": "I have used both.\n\nThe Magic Keyboard feels better to type on, with a more satisfying feel and better build quality. It includes a TouchID button and matches the layout of my MacBook Pro’s internal keyboard, which is a big plus for me. It also has all the familiar F-key shortcuts for controlling brightness, volume, etc. However, the lack of backlighting is a significant downside.\n\nOn the other hand, the MX Keys also feels good to type on, though it feels a bit spongier. Its build quality is solid but not as good as the Magic Keyboard. The MX Keys does feature backlighting, which is a major advantage. While it has some F keys, it doesn’t include all the ones available on the Magic Keyboard. I like the fact that you can connect it to up to three devices, although these days I only really use one computer.\n\nI used the MX Keys as my daily driver for several years and loved it. However, after trying the Magic Keyboard, I couldn’t go back, despite wishing it had backlighting.",
            "score": 12,
            "sentiment": "positive"
          },
          {
            "author": "Unl00kah",
            "body": "I like the fingerprint sensor on my apple\nKeyboard but if it wasn’t for that, I wouldn’t use the apple keyboard. I know it’s silly but that’s why I have one.",
            "score": 4,
            "sentiment": "neutral"
          },
          {
            "author": "spif_spaceman",
            "body": "I’ve gone back and forth, usually I prefer the Magic Keyboard over anything else. If my office was darker, backlit would be a bigger benefit. \n\nBuild quality and Touch ID are pretty awesome.",
            "score": 5,
            "sentiment": "positive"
          },
          {
            "author": "pcw2015",
            "body": "Have both, but i prefer apple keyboard because of lower keys similar with macbooks.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "ClarkTheCoder",
            "body": "I have both. I made a video comparison below:\n\n[https://www.youtube.com/watch?v=JegfG5sHeTo&amp;t=316s](https://www.youtube.com/watch?v=JegfG5sHeTo&amp;t=316s)\n\n  \nTLDW: I prefer Magic Keyboard,",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "_-Kr4t0s-_",
            "body": "I don’t like either, but if these are the only choices, then the Apple one. If you type faster on it then it means you can finish your work faster and go home earlier. Nothing else is as important.",
            "score": 5,
            "sentiment": "neutral"
          },
          {
            "author": "PartyDJ",
            "body": "i moved from mx keys to a magic keyboard and i couldn’t be happier. i’m obsessed with the macbooks clicky tactile keyboard and the magic keyboard matches or rather gets really close to it. just wish it was backlit",
            "score": 5,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 4,
            "sentiment": "neutral"
          },
          {
            "author": "JuggernautOnly695",
            "body": "I'd go for a full mechanical keyboard. I use a keychron q5 pro with my MacBook when it's docked. No neee for touch id as I can either use my watch or just type my password to unlock passwords.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "ExamGlittering6598",
            "body": "Only reason I will choose magic keyboard over any keyboard is touch ID.It keeps apple’s design philosophy in mind not practicality. If you want a low profile keyboard you can also check on nuphy.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "elliotblyth",
            "body": "I switch between both everyday and would definitely go for the Magic Keyboard. The keys feel better, the layout is better, and the size is better. Plus the magic pairing system (just plug it in once with a lightning cable and it’s done) is awesome.\n\nI only use the MX Keys bc it’s at a different location and I occasionally use a PC there, and the MX has a better function key layout and device switching. But if it’s only for a Mac, definitely go Magic Keyboard!",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "Newt_Lv4-26",
            "body": "Magic Keyboard = quality materials and durability. We have some at work still going strong after 10+ years of disgusting people eating while typing and not washing their hands at all. Touch ID is great. It’s so much faster I hate not having it at work even more since I have it at home.\n\nMx = cheap plastic, will **probably** yellow over time. (I have no experience with them)",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "danielandastro",
            "body": "Magic Keyboard Type C variant should be out soon I’d imagine",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Aggravating_Loss_765",
            "body": "Apple magic has the worst ergonomic shape ever.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "[deleted]",
            "body": "You will use the Touch ID on your Mac everyday so it's better to invest in the Magic Keyboard",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "RcNorth",
            "body": "I use MX keys. \n\nCheaper so I’m not as scared to take it with me. \nI leave the laptop open so I can use Touch ID if needed (I also have an Apple Watch which covers some of the Touch ID needs)\n\nI have a Windows machine that I can switch between by moving the cursor to the edge of the screen (thanks to Logitech Flow). \n\nI also have an MX Master 3 mouse. Highly recommend.\n\nI also use the MX keys keyboard with my iPad.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "JollyRoger8X",
            "body": "I use both the Apple Magic Keyboard (without Touch ID) and the MX Keys (full sized version) daily. They are both terrific keyboards.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "tlrmx24",
            "body": "Mx keys mini is better for me",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "allmyfrndsrheathens",
            "body": "Just be aware with Bluetooth keyboards - if you are ever trying to set up a new or freshly restored Mac and that is your only keyboard you will not be able to. I ran into this when I set up my Mac mini, only had an mx keys mini and had just cleared out my linen cupboard and thrown out my dingey old usb keyboards. Ended up having to use my Microsoft media keyboard/trackpad combo because it used wireless usb rather than Bluetooth. \nThat aside it’s a nice keyboard and I quite enjoy using it.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Lower_Fan",
            "body": "I'm gonna throw some better keyboards for people who are after a real nice riping experience but still want a slim keyboard \n\nLofree flow \nNumphy v2 ",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "diy-pro",
            "body": "Once you've used Touch ID, you'll never go back. I also have the bigger keyboard with the number pad. If you have to type a lot of numbers from time to time, this is also a timesaver. I always missed those when using the compact ones. The type feeling of both is very good. The MX might have a slight edge. But yeah, that Touch ID...",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "RalfWilliam-rbc-de",
            "body": "I got both - the mx mini is the better one\nAnd the backlight makes it even better ;)",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "robreto",
            "body": "I only went to MX because I use the set up across multiple devices including Windows and Linux so great to have a device that supports all",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "EmileDorkheim",
            "body": "I have a MX Keys Mini and it's perfect for me, but only because I need to switch between MacOS and Windows a lot and they make a version with key markings for both systems. If I didn't have to use windows I don't see any reason not to use the Magic Keyboard. Personally I don't think the backlight does anything for me as I always have a pretty bright desk lamp turned on.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "butterbuts",
            "body": "I find the apple keyboards key coating is far superior to Logitech and it never seems to go greasy like my Logitech ones do",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "you can find second-hand touch id keyboards on ebay for pretty cheap, as they come with the iMacs. I bought a purple one for around $60 and aside from a couple scuffs it functions perfectly. \n\nAlso yes the only way to buy colored magic keyboards is buying an iMac or going second-hand.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "AthensThieves",
            "body": "Been meaning to upgrade to the Touch ID keyboard but can’t believe it isn’t USB C. I’d personally get a mechanical keyboard or the Logi keyboard —upgrade when apple updates their keyboard",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "bora-yarkin",
            "body": "I went fır the mx keys mini because i find i type on it faster (because of concave keys i think), cheaper, multi device support, backlight and most importantly Type-c. All of my devices are type-c. No exception. I even did a type-c mod on my old portable wifi which was micro usb.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Act_True",
            "body": "Choose USB-C!\nyou can pair it with a Logitech mouse and have it use one dongle for both.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "pekz0r",
            "body": "I have used both, but I liked MX Keys better, but I do miss Touch ID. Both are very good keyboards though.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "skoomafueled",
            "body": "I'd go for the magic, the battery life is bonkers, I can go weeks without recharging.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "QuantumHamster",
            "body": "Have both, although I have the older large Magic Keyboard with numpad but no Touch ID.  I like the feel of the keys of the Mx mini better , more ergonomic, whereas the Magic Keyboard feels like you’re tapping your fingers on a a tabletop. but the layout of Mx mini is not as good as the Magic Keyboard, or at least I’m used to the MacBook keyboard layout. I have toted the Magic Keyboard in my backpack. I would not do that with an Mx mini. So if you care about portability and Touch ID (I miss the latter) go magic\n\nEdit: After a few weeks on the mx mini, i still can't get used to the layout... So I would swing magic keyboard if you're used to it, the keys are just in the right place.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "godmorpheus",
            "body": "Does the f3 key on MX work like in the apple where you see all tabs?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "TheDaddyStovepipe",
            "body": "I have both (well the Mx keys full size one) and prefer the Apple one. Although the multi device on the MX is good when I’m WFH between MacBook and work laptop",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Leslie__Chow",
            "body": "MX keys",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "ari_wonders",
            "body": "I still have the MX Keys full in my Amazon kart, lol. But I keep on using my Magic Keyboard. I don't know what it is but  it's just so satisfying to type on this thing. The Logitech one is also super sturdy, but I don't feel like spending my cash on something that I'm happy with another keyboard that gets the job done.\n\nPoint being, I don't know what it is but the typing experience on this expensive Magic Keyboard is different.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "I tried the MX keys - full version - I don't know how anyone can live without a number pad, forward delete, etc. I hated it. Wouldn't respond to input first thing in the day till I pressed a key FOUR times. Requires Logitech software to get full functionality - no thanks to spyware! Mainly, it just didn't feel good. Got the Apple Magic with touch delivered today - and I'm in love! The touch key is a game changer, the keys feel great, just the right amount of resistance, and it's quite a bit smaller than the Logitech - the less desktop space taken up, the better. ONE THING bugs me about the Magic Keyboard - it says it's USB-C - but the part that plugs into the keyboard is still Lightening! The MX keys was USB-C on both ends. Also worth noting that Apple raised the price on the full-size Magic to $199 the other day - but I found it at Costco for $169. I was deciding between the older version without Touch, but it was a Lightening to USB-A connector, which I didn't like - and for $40 more bucks, the Touch is totally worth it. Anyway, if you spend a lot of time on a keyboard, and figure this thing will last at least 5 years, maybe 10 - it's totally worth the high price tag.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "_chrisarc",
            "body": "Anyone use the mac specific model of MX Keys S (full size) without windows markings and find that better than going with the new magic keyboard with USB-C port that just came out? \n\nBig draw to going with MX Keys S for me is the fn row keys like calculator and screenshot which I use often enough that it's annoying using spotlight to bring it up and then click into it instead of just coming up with one touch, but I just discovered how to make custom shortcuts so that might not be relevant to me anymore.  Are there other functions on that row that can't be easily set up to arrange in Mac settings that the MX does or can be set up to do with their program? \n\nOther thing is being able to switch easily between devices, which for me would be an ipad mini and likely my phone, but now there's phone mirroring and as far as I'm aware it's pretty easy to link your ipad to be able to use the keyboard with it when needed either as sidecar or just being next to it in normal ipad mode (I still don't have the ipad, in the mail now) -- correct me if I'm wrong there. So far the only comments on switching between devices that I've seen have been from people also using windows/linux which I will not be doing, so wondering what people's thoughts are on these scenarios and if that rules that part out of the pros to MX vs MK.\n\nBesides those, huge draw for me with MX is price and draw to MK is touch ID.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Zestyclose_Cake_5644",
            "body": "MX Keys is nice and so are any other third-party keyboard but the fact that they call themselves \"made for Mac\" and don't have a \"globe and / or function\" key drives me nuts. Globe is fn but fn is not globe.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "TonyFloats",
            "body": "It ultimately comes down to personal preference, but having owned both, I think the Apple Magic Keyboard is clearly the better choice. It has a sleek metal build that feels solid without being heavy, and it’s noticeably lighter without coming across as cheap. The switch mechanism is snappier and more responsive compared to the heavier, mushier feel of the MX Keys.\n\nDesign-wise, there’s really no competition—one is slim and minimal, the other feels bulky and outdated. From a hardware perspective, the MX Keys feels like it’s a few generations behind the Magic Keyboard.\n\nSure, the MX Keys offers more software features—like backlighting and device switching—but how often do people actually use those? Personally, I never used the backlighting and only switched devices a handful of times. That alone isn’t enough to outweigh how much better the Magic Keyboard feels to type on and how much cleaner it looks on a desk.\n\nOn a side note, I own the version without Touch ID, which cost the same—if not slightly less—than the MX Keys here in Australia. So my comparison is based on the assumption that the two are priced similarly.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "VYRus57",
            "body": "I was really confused between these options and Keychron as well. My gut told me to get the Apple Magic one, and now I'm pretty sure. \n\nI was using Royal Kludge, and it was a really bad product. Even after returning and replacing it, I encounter new problems every day.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "SirDale",
            "body": "Put the trackpad on the left of the keyboard.\n\nThey are useful for different thing - the trackpad is great for scrolling, the mouse for pointing, clicking.\n\n I have it set up this way and love it.",
            "score": 1,
            "sentiment": "positive"
          }
        ]
      },
      "link": "https://www.reddit.com/r/mac/comments/1eydnts/cant_decide_between_apple_magic_keyboard_or_mx/"
    },
    {
      "postInfo": {
        "title": "My thoughts on the MX Mechanical Mini vs MX Keys Mini",
        "content": "I posted this in response to a comment in another subreddit, I figured I'd post it here too as I could not find non-reviewer content about the MX Keys Mini before I purchased it.\n\n\nI've been using the MX Keys mini for about a year and I've had the MX Mechanical mini for a few days and there are definitly noticable differences, but as of right now I can't say I actually prefer the MX mechanical mini and I'm not certain I'll keep it. So far I've noticed:\n\n**Backlighting**\n\nThe backlgihting on the MX Mechanical Mini is much brighter and just looks better overall. However, it's mostly wasted on me as I tend to keep it off unless I'm working in a completely dark room.\n\n**Typing Experience**\n\nThe keys on the MX Mechanical Mini are much closer together, I'm not sure if it is objectively better or worse but right now it's causing me to make a lot of typos.\n\nThe MX Mechanical Mini is significantly louder than the MX Keys mini (I got the 'Tactile Quiet' version) - this was to be expected, I will say though it's nowhere near obnoxiously loud and the pitch of the sound it makes is actually rather pleasant (i.e. more 'thunk thunk' than 'clack clack').\n\n\nSo far I have found the MX Mechanical Mini kind of fatiguing to type on. It makes sense as my fingers are travelling a much greater distance with each key press and the keys themselves take more force to actuate. I'm pretty sure I'd could get used to this and it would become a non-issue very quickly.\n\n**Layout**\n\nI prefer the full sized arrow keys of the mechanical mini to the shrunken ones of the mx keys mini, in my year of using that keyboard it's my only major complaint. But while the MX Keys fixes the arrow keys problem, it introduces a different one (for me at least).\n\nThe row of keys that are positioned to the right of the return key, shifts the center of the keyboard away from what I am used to, it's throwing me off at the moment (especially with the return key - I keep hitting end/pgup) but I am pretty certain I will get used to it. Worst case I'll just remap each key on that entire row to assume the same function as the key directly to the left of it (except 'del' which is where it should be).\n\nOn a more positive note - I prefer the 'fn' key placement on the MX Mechanical Mini - it's on on the right hand side of the keyboard, it makes much more sense for me and it doesn't mess with my muscle memory for the CRTL/OPT/ALT keys like my MacBook and MX keys mini do (FN and CTRL are reversed and when I always get mixed up when I swith between them). It also has the added benefit of allowing me to lock my screen with one hand - something I've sorely missed from my windows days.\n\n**Battery Life**\n\nWhile the MX Mechanical has significantly better battery life on paper, I can't say that I ever found the the MX keys mini lacking in that department. Again - please note: I very rarely use the backlight.\n\n**Wireless Performance**\n\nI use both keyboard exclusively via bluetooth on my two MacBooks (2017 12 inch and 2019 16 inch). \n\nBoth keyboards operate flawlessly via bluetooth, and with a pinch of salt I'd like to note that it it *feels* like there is *slightly* less latency with the MX Mechanical Mini. And I mean *slightly* as in almost to the point of being imperceprable, as in almost to the point that I'm almost certain I'm imagining it, as in almost to the point that I even contemplated removing this entire section because I'm potentially just muddying the waters by saying anything.\n\n**Build Quality**\n\nReviews keep mentoning the exceptional build quality of the MX Mechanical Mini, I disagree, I'd rank it as simply 'good'. For the amount this keyboard costs, I'd have liked to see a full aluminium builld rather than just the top plate.\n\nIn fact I actually think the the type of plastic they used on the MX Keys mini is superior and until a week ago I would have sworn that keyboard was made out of brushed aluminum (the fact that it never gets cold should gave tipped me off sooner.). I have zero complaints about the build quality of the MX Keys Mini, and after a year of 10-12 hours a day use, it's still perfect.\n\n\n**Conclusion**\n\nAfter about a week of using the MX Keys Mini I can say that overall I like it and it is a good keyboard - it has not however 'wowed' me, and I don't see many benefits over a mechanical keyboard from another company at half the price. I think it only really makes sense for someone like myself who is already heavily invested in the logitech ecosystem and makes use of features such as 'flow' on a regular basis.\n\nI think I'm going to give it another couple of days of using the MX Mechanical Mini exclusively, then I'll switch back to the MX Keys mini and see if the difference is large enough to keep the mechanical.",
        "author": "[deleted]",
        "score": 42,
        "comments": [
          {
            "author": "Logitech_ARV",
            "body": "Hello u/L8Z4ekrPk4GSFEnX6JPR,\n\nThank you for reaching out and sharing the feedback. We will pass this along to our team. We always want to ensure we are providing our customers with the best products and experience. Let us know if there is anything else in the future we can do to assist.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "ctump",
            "body": "I have to say this:\n\nI used to use Microsoft keyboard, and after two weeks of thinking, I got the MX Mechanical Mini.\n\nGosh! The best decision ever. I really loved the feeling of writing in that keyboard. I have a good impression. \n\nUnfortunately, I had a problem with the backlight of the keyboard and I opened a warranty issue. I don't expect to get a new keyboard, I just want my keyboard fixed :( \n\nI've seen the Logi support in social media and I saw they're good and helping customers. \n\nHopefully they will help me with this and keep using the keyboard.\nI also got the mouse MX 3S and it is amazing.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "arekxy",
            "body": "I used both, mx keys mini and mx mechanical mini. mx keys mini was much nicer to use. It is lower in height, so less fingers movement needed and thus faster typing. Another problem is that layout on these keyboards (mx keys mini vs mx mechanical mini) is different (!).  Fn in different place, different enter. That's quite stupid thing logitech did.\n\n&amp;#x200B;\n\nmx keys mini build quality isn't good unfortunately.\n\nAfter 11 months of usage keycaps look like this\n\n[https://i.imgur.com/LUZhJ88.jpg](https://i.imgur.com/LUZhJ88.jpg)\n\n[https://imgur.com/JQz14fl](https://imgur.com/JQz14fl) (thing around letters is ... a tiny recess which grows)\n\nAbout 10 keycaps is affected so far on this keyboard.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "mariano500",
            "body": "Comrpe uno .. creo que las telcas son muy duras.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Kind_Lawfulness_1699",
            "body": "Una pregunta, estoy analizando si comprar el MX Mechanical Mini por un tema. Soy dev y tengo dos computadoras, una Mac donde la uso para laburar solamente y una windows gamer donde solo la uso para jugar. Tengo ambas en el mismo desk, entonces necesito algo para switchear para laburar y jugar. Ambos teclados tienen que tener distinta distribución por el tema del sistema operativo. Yo actualmente tengo un teclado gamer para jugar pero quería saber qué tal la respuesta del MX Mechanical para ver si reemplazo el que tengo para jugar.\n\nDesde ya muchas gracias",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "shemmypie",
            "body": "Did you end up keeping the mechanical?\n\nI received the MX Mechanical Mini last night and will be starting to use it today. I've had the MX Keys full for a little over a year and loved it. I just wanted a 70% keyboard for ergonomics. Centering the keyboard keys to me, pushed the mouse far off to the right. Boss gave me a gift card that paid for it so figured I'd go with the more expensive one but I really liked my mx keys so still considering returning this one for the mx keys mini.\n\nI have had many mechanical keyboards and do like them. I have a work computer and home rig so Logitech's easy switch is why I am sticking with them.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "AceKylin",
            "body": "Hi, I hope I don't bother you. May I ask a question regarding BT connection in MX mechanical? I was using mx keys and it's BT connection is awesome. It wake up from sleep mode immediately. Even when my laptop is in sleeping mode, I only need to type 1 key and both keyboard and laptop wake up immediately. Now, I am thinking to try a mechanical keyboard, I tried Keychron, but it takes forever to wake up. How is MX mechanical. Is the BT connection as good as MX keys?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "SpiritOfTheVoid",
            "body": "I got the Mini Mechanical today, but I'm going to return it and get the MX Mini, for many of the points you raised.\n\nThe keys on the mechanical have more travel - it's a shame it's not like G8/915 because the travel is perfect.  Also the key layout - OMG, I've never made as many typos!  I find it really difficult to type on.  \n\nAlso the angle of the keyboard is too steep.\n\nThe height of the Mechanical as well, it's too high for the Logitech MX wrist rest - so I'd need buy another... but it's not regular keyboard heigh.. sigh.\n\nQuality wise, it feels solid, but unfortunately, I prefer the keys of the original MX.\n\nI do like the extra lighting options though!",
            "score": 1,
            "sentiment": "negative"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/wvz3kb/my_thoughts_on_the_mx_mechanical_mini_vs_mx_keys/"
    },
    {
      "postInfo": {
        "title": "Best wireless mouse/keyboard combo to use in your opinion?",
        "content": "I’m shopping around and trying to see what people like the most. I tried the Magic Mouse and for some reason I didn’t like how it felt. Any input / links will be very helpful. Thanks in advance ",
        "author": "Dave-Austin-Texas86",
        "score": 39,
        "comments": [
          {
            "author": "[deleted]",
            "body": "Logitech MX Keys and Mouse, I’ve put 4 people on them so far. Best Buy has a combo package if you want. I personally have the ones made for Mac but I use equally on MacBook and windows PC.\n\n\nOne thing I want to add, the Logitech mouse sucks on iPad. It seems only Magic Mouse works well on iPad. I don’t use my iPad that much, so it hasn’t been an issue for me. But keep that in mind, not sure if any 3rd party device works that well on iPad",
            "score": 68,
            "sentiment": "positive"
          },
          {
            "author": "MsBelleMae",
            "body": "Logitech MX Master 3S for Mac and the Apple Magic Keyboard. If you really feel like going the extra mile the Magic Trackpad is top tier as well.",
            "score": 17,
            "sentiment": "positive"
          },
          {
            "author": "JudgeCastle",
            "body": "Mx master and Magic Keyboard. If you don’t like the Keyboard, replace with one you do like. Personally I switch between Magic kb and my Kinesis split mechanical ergonomic",
            "score": 9,
            "sentiment": "neutral"
          },
          {
            "author": "_MrFade_",
            "body": "Mouse: MX Master 3s",
            "score": 9,
            "sentiment": "neutral"
          },
          {
            "author": "deklined",
            "body": "Logitech M720 Triathlon",
            "score": 5,
            "sentiment": "neutral"
          },
          {
            "author": "brownguymadeit",
            "body": "MX Master 2s or 3s what ever one you can afford, both amazing.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "RozenKristal",
            "body": "Nuphy air and logitech master",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "Logitech MX series you can try.  You can go for the standard magic mouse and keyboard.  Also try other Logitech devices. I actually like the MX series myself.  Very responsive a decent amount of customizing you can do with it.  But I like the responsiveness the MX series has with the MacBookPro.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "I wanted to reply to your post because nobody really talks about a very important issue: polling rate + latency.\n\nI have a magic touchpad + Magic Mouse ready to be returned to Apple. The latency Is just atrocious for my eyes, so much so that both the Magic Mouse and the Magic Trackpad have returned in the box 5 minutes after I opened them. \n\nI believe the integrated touchpad is at 240hz or something along those lines. So, when using anything below that, you will feel the added latency, especially considering the display on m series MacBook Pro's is 120hz.\n\n The keyboard can be at 90hz, who cares really ( unless you're in the Guinness world record for typing speed), but the mouse absolutely not. \n\nMy advice: \n\nLogitech G pro mice ( Pro, Pro X super light etc) , if you fancy the price and like them - they work well with MacOs\n\nKeycron m3 -  this is also bluetooth, and it looks like it has a 120 hz polling rate under bluetooth and 1000hz with the dongle, so it should fee smooth. + you have a usb-c dongle to use with the Mac ports.\n\nDownload the Mac Mouse Fix app to fix gestures, you won't regret it.",
            "score": 3,
            "sentiment": "negative"
          },
          {
            "author": "helloween123",
            "body": "Mx Masters and Keychron K10",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "squirrel8296",
            "body": "I just use the Magic Keyboard with Numeric Keypad and Magic Mouse (along with a Magic Trackpad for when I'm at my desk in clamshell mode). I've honestly used Magic/Apple Wireless peripherals since 2011 and never had an issue with them.\n\nI've also tried friends and coworkers Keychron keyboards and they are awesome. Super high quality keyboards for reasonable prices. I'd definitely recommend one if you prefer higher profile keyboards or mechanical keyboards.\n\nI tried the Logitech alternatives. Prior to 2011 (when I switched to Mac) I used Logitech keyboards and mice with all of my PCs. While I dislike the shape of the shape of newer Logitech Mice (I tried all of them and they're all either too big or had a weird angle), the quiet click buttons on the newest versions of the MX Mice are nasty, mushy, and offer almost no tactile feedback. The key switches on the MX Mechanical honestly felt no better than the cheap membrane keyboards that come free with most desktop PCs, they were hands down some of the worst mechanical key switches I've tried. The MX Keys was fine (albeit the Magic Keyboard key switches are better), but the full size Magic Keyboard is only $20 more (and worth it for the better Mac integration) and the smaller Magic Keyboard (with better Mac integration) is actually $10 less than the Keys Mini. Logitech's products have definitely gone down in quality recently at the same time they've gotten a lot more expensive.",
            "score": 3,
            "sentiment": "negative"
          },
          {
            "author": "i4k20z3",
            "body": "Arker 3 device Bluetooth keyboard and Mx Master mini bluetooth mouse. does the job on the cheap and feels great.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "TsunaTenzhen",
            "body": "Logitech MX mech mini and magic track pad. I can't use a mouse anymore because gestures are too important.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "rorowhat",
            "body": "Logitech mouse and keyboard combo. There are tons. One dongle to connect both.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "I use a combo between the MX Master 3S mouse, the MX Mechanical Keyboard, and Apple’s Magic Trackpad. This setup really works well for me.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "makegoodmovies",
            "body": "logitech bluetooth mouse or wired mouse, but for keyboard, I actually prefer the old apple wired keyboard with keypad which i bought used off ebay for about $20.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "indicava",
            "body": "Logitech G705 is a great mouse but not too comfortable for larger hands.\n\nLogitech G915 Tactile is an awesome keyboard",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "GudPonzu",
            "body": "Magic Keyboard + Magic Trackpad is the GOAT combination",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "Techliterati",
            "body": "MX Keys for Mac. Expensive but worth it.  Been using my Mac one for close to two years and I have a pc one that's mine, but I keep it at my desk at work.  Love the weight, the tactile feedback and the multi device control features.  I own 2 kbs, and 2 of the MX mice.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "lovinglifeman",
            "body": "Magic Mouse and Magic Keyboard",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "SedimentSock82",
            "body": "I have an MX Keys that I just retired for a wired mechanical. I loved that thing but needed a number pad.\n\nI use the Magic Mouse when working and I’ve gotten used to it but use a Razer Basilisk as my personal mouse",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "aieidotch",
            "body": "Vortex M0110 and https://www.ebay.de/itm/125915566672?chn=ps&amp;_ul=DE&amp;norover=1&amp;mkevt=1&amp;mkrid=707-168914-925416-0&amp;mkcid=2&amp;itemid=125915566672&amp;targetid=293946777986&amp;device=m&amp;mktype=pla&amp;googleloc=1003297&amp;poi=&amp;campaignid=20357221430&amp;mkgroupid=146340207970&amp;rlsatarget=pla-293946777986&amp;abcId=&amp;merchantid=7364532&amp;gad_source=1&amp;gclid=CjwKCAjw0YGyBhByEiwAQmBEWjQ1pi11cgBH8Xqhi05NOrg9q8f2nKil_MmwGFyuHdrtBbFI_xRtZxoC51UQAvD_BwE",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "Honestly… none! The macbook keyboard and trackpad are awesome",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Domi4",
            "body": "Using mouse on a Mac is a frustrating experience. Doesn’t matter which brand or model. It can only suck a bit less. \nI have Logi MX Master 2s and hate using it with the Mac.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Manfred_89",
            "body": "Keychron K3 and some random amazon bluetooth mouse.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "gabryp79",
            "body": "ROYAL AXE Y87 and MX Master 3s, best combo!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "StormChaseJG",
            "body": "I like the Magic Keyboard and I have a Magic Mouse that I got with it but find myself using the MacBooks trackpad more often, I would love to get the Magic Trackpad but can't justify the cost when 99% of the time I can just use the MacBooks own trackpad as its rare I use my laptop with it docked and on another screen.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Aylarth",
            "body": "OMOTON Bluetooth Wireless... https://www.amazon.co.uk/dp/B019O1R4DQ?ref=ppx_pop_mob_ap_share\n\nLogitech M240 Silent Bluetooth Mouse, Wireless, Compact, Portable, Smooth Tracking, 18-Month Battery, for Windows, macOS, ChromeOS, Compatible with PC, Mac, Laptop, Tablets - White https://amzn.eu/d/caFHcKS\n\nYes you can spend more I just don't understand why would you do that...? 🤷‍♂️",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "kzmskrttt",
            "body": "I really like Keychron K2 and MX Master 3S. Keychron is very pleasant to write on.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "BENdage",
            "body": "Logitech mx master 3S and \nKeychron K3 Pro",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "dobbyonadderall",
            "body": "MX ERGO PLUS!\n\n  \nMX Master 3S - hell no!!! the S stands for dog\\*\\*\\*\\*",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Life-Hall-9924",
            "body": "Go for MX from Logitech best buy for Mac !! I loved the magic mouse but once I used MX I cannot go back, Logitech is very ergonomic",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Daavek",
            "body": "Nuphy Air 75 v2 and MX Vertical / Master 3s.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Fernandeep",
            "body": "In my opinion Logitech keyboard K780 is the best keyboard out there. Paired with the Mx master 3 mouse.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "whytayk55chauvin22",
            "body": "Here I am thinking I’m a stud with my wired Razed + dongle 🤣",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "bbcoritv",
            "body": "Mgic keeb and magic trackpad",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Difficult-Ad-3938",
            "body": "Any Keychron that fits with Mx master 3",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Corrrsten",
            "body": "G915 tkl white and g502 wireless white",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Sketaverse",
            "body": "Apple Magic Keyboard for the finger security thing and MX3 mouse, def the best combo",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "tillemetry",
            "body": "Like the Logitech MX 3 Master Mouse.  The Mac version of the Kinesis Freestyle 2 ergonomic keyboard (I don’t use the lifters) works best for me.  I’ve tried many other ergonomic keyboards, and it is the only one that doesn’t annoy me but doesn’t leave me in pain either.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "fistikidis",
            "body": "Well I got the apple Magic Trackpad since Mac OS is all about those gestures for me and I my MacBook in clamshell mode all the time. For the keyboard I got the Logitech G715 and really like it. It does not have dedicated Mac buttons just to know. Although having the Touch ID of the Apple keyboard is a big convenience.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Memed_7",
            "body": "keychron m3 mouse and for keyboard i’d honestly go with the magic keyboard",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Rakenroler",
            "body": "I used the ones that came with the 2009 iMac it seems to work well with my Dell Inspiron. I don’t use the iMac very much nowadays it’s stucked with High Sierra so now with Windows 10 the wireless kb and mouse it seems to work well minus right click.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "jaganm",
            "body": "For years, I’ve been using a Logitech MK850 combo, which works wonderfully with my office laptop and mac as it supports 3 devices. However, for my Mac, I moved to a combination of the Magic Keyboard with Touch ID and the Magic Trackpad and I cannot ever fathom going back to a non Apple KB+mouse. It’s the way scrolling works, the way I can move between desktops that I cannot match with a mouse (I also have a MX Master 3s). I’ve now gone all in, combining this with a LG Ultrafine 5K and using my MBP in clamshell mode all the time. For my PC, I’ve moved to a completely different setup, with a lower resolution QHD monitor combined with the Logitech combo.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Guzzlemyjuice",
            "body": "Logitech superlight and a Magic Keyboard floats my boat.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "TherealDaily",
            "body": "I loved my Mx Keys and Mx Master, but I switched to Apple wireless with Touch ID because I use fingerprint ID frequently. I also bought the Apple trackpad. Amazon sells a decent two-in-one case (it's cheaply made, but I filled it with silicone for more substance). Now, I have a setup that feels like a laptop with a giant 5K screen. Best of both worlds. I can send a link if you’d like.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "SheepherderOk1448",
            "body": "Is the MX mini kb compatable with the MX Master S3?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "TelesisPrime",
            "body": "Nuphy Air75v2 and Logitch MX Master 3S - Hands down best combo I've had in over 20+ years of keyboards and mice",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Ade231035",
            "body": "I use a RK100 and Logitech M720 Triathlon, and they’re both good (the mouse is a good budget choice), but for the keyboard I’d buy a set of Mac legend keycaps for it",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "drakontas_",
            "body": "I use the regular Magic Keyboard (the old one from the intel iMacs) with a Logitech G900 mouse. The mouse isn’t super portable like the Magic Mouse but I love the feel and responsiveness",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "itsnotajersey88",
            "body": "Logitech ergo k860 and logitech Mx ergo trackball is how I roll.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "Logitech MX Master 3s Combo",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "I have a Logitech K850 (you can generally get it paired with a mouse for the same receiver) it's got a subtle wave to it that helps with keeping my wrists from straining when doing lots of typing.\n\nThough they've got a newer 'Wave' keyboard that I'm very tempted to purchase.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Dave-Austin-Texas86",
            "body": "Thank you to everyone for yalls input",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "leaflock7",
            "body": "I use  \n\\- Apple's Trackpad  \n\\- Apple's Keyboard  \n\\- Logitech MX 2s  \n\\- Nuphy Air75  \nMost times I use Apple keyboard (when on Mac) because it is so similar to the MacBooks . While any other keyboard it has the keys slightly different so muscle memory ....",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "DrinkIcedWater",
            "body": "I have the Logitech MX Keys S, trust me when I tell you the Magic Keyboard is better.\n\nThe only reason I got the Logitech is because it supports 3 devices, so it makes it easy to switch between MAC OS and Windows devices.\n\nOther than this and the backlight, the actual typing experience is inferior to the Magic Keyboard.\n\nRegarding the mouse. The MX Master 3S is taller than most mice, and it causes hand/wrist cramps despite being an ergonomically designed mouse. The MX Anywhere 3S is much more comfortable in my opinion. Horizontal scrolling is different on both, something to take into consideration! The best mouse for me, believe it or not is the cheaper M705 because of the horizontal scroll built into the wheel. However, this mouse does not support BT or multiple devices, you have to swap the receiver between devices.\n\nIf you’re only using MAC, get a Magic Keyboard and Anywhere 3S.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "SomeIrishGuy81",
            "body": "Magic Mouse is great, once you get used to side scrolling and the ‘back’ gesture, using other mice seems antiquated. Are there non magic mice, that also perform these functions?",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "---Joe",
            "body": "Kensington slimblade pro- save your wrists and its actually way faster AND more precise. For keys i personally like the apple keyboard a lot so using that.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Namazon44",
            "body": "Razer mice",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Ediflash",
            "body": "For me its Magic Keyboard and Magic Trackpad only when using an external monitor.  Its basically the almost like using the built-in keyboard and trackpad when on the go. You get better gesture control and ergonomics compared to the Magic mouse (which I personally dislike).\n\nIf you generally dislike using trackpads, then you might want to get something like an Logitech MX Master",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "PartyDJ",
            "body": "mx master 3s magic keyboard and magic trackpad",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "jusatinn",
            "body": "I have the MX Mechanical Mini, a G603 wireless and a Magic trackpad.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "sadlyanon",
            "body": "i like the aesthetic of the magic mouse and the black color is really attractive!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Xenotester",
            "body": "Usually combo isn't great - buy it separately",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Specific-Football548",
            "body": "MX master 3S mouse, not my opinion, but a fact.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "dhojey",
            "body": "Using Keychron K10 and Logitech MX Master 3S.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "jdotphotos",
            "body": "Keyboard I just use the Mac keyboard. Mouse, I’ve taken a liking to the razer orochi v2",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "merowley",
            "body": "I like my Mx keys keyboard and I paired it with a marathon mouse.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "SorryPossibility4698",
            "body": "I really like whatever your mom uses when I am at her place banging her",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "thegdub824",
            "body": "Magic Keyboard with touchID and Magic Mouse",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "heyarkay",
            "body": "Magic Trackpad Magic Keyboard literally won't use a mouse anymore",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "TCEHY",
            "body": "I use the lightest Logitech wireless pro mouse. 149 but worth it \nAlso the tenkeyless wireless keyboard",
            "score": 0,
            "sentiment": "positive"
          }
        ]
      },
      "link": "https://www.reddit.com/r/macbookpro/comments/1d5qkx9/best_wireless_mousekeyboard_combo_to_use_in_your/"
    },
    {
      "postInfo": {
        "title": "Mx keys backlight always on",
        "content": "Hi, is there a way to always leave on the backlight in the mx keys?",
        "author": "furious_turing",
        "score": 202,
        "comments": [
          {
            "author": "HugePiglet",
            "body": "Funny.. bought this keyboard, 1st search for me in the settings, where can i set the light to always on, or at least timeout of about 60 seconds. Can\\`t find it, go look online and i see this old thread..  seriously Logitech?!?..",
            "score": 9,
            "sentiment": "negative"
          },
          {
            "author": "No_Present9912",
            "body": "So I've read the thousands of entries on this and I've come to several conclusions:\n\n1) Logitech doesn't see this as a problem so they aren't going to fix it. It;s not broken in their eyes so they are going to spend the resources.\n\n2) The poor guys who monitor this thread can't do anything except pump out company rhetoric. Yelling and berating them won't do any good as they are at the bottom of the food chain. I mean let's face it, if your job is to field Reddit complaints all day, you're not getting a key to the executive washroom anytime soon.\n\n3) I wasted $150 on a keyboard because I trusted the Logitech name. I gave up my K800 and I'm kicking myself for it. When this show up, it felt good. It had some heft to it. It was rechargable and had backlighting like my old one. I have visual issues and backlighting is helpful. The K800 lights didn't stay on all the time but the letters were white on black instead of this grey on grey. I could live with the grey on grey if the lights would stay on but they don't and now after reading all of this, I realize this will never get fixed.\n\n4) I am disappointed in the other offerings from Logitech since they too will probably have features that are \"good for me\" or \"cutting edge\" instead of features that are actually user friendly. Like others here, I will probably end up with a Microsoft one or some other one just as crappy. At least with Microsoft, when I swipe my card, I know I'm getting crap. There will be no surprises there.\n\nOn a (not so) humorous side note, this little missive of mine would take the average user 5-10 minutes to write but since I can't see a damn thing and have had to correct a lot of mistakes, it took me over 30 minutes. Oh well, it's a good thing I'm retired. I guess I'm off to Walmart...",
            "score": 7,
            "sentiment": "negative"
          },
          {
            "author": "neon2012",
            "body": "I just bought the MX keyboard. The constantly cycling backlight is distracting and annoying.",
            "score": 8,
            "sentiment": "negative"
          },
          {
            "author": "s173nc3r",
            "body": "I would like to have this feature too. \"Always on\" or to be able to set backlight time when hands are AFK 0-60s or so.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "rahka20",
            "body": "As far as I know, that isn’t possible yet.. maybe in a future update.",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "logi_sd",
            "body": "Hi there,\n\nPlease be informed that as Mx keys keyboard is designed differently. The backlight cant be set to on all the time. \n\n About the illumination settings of the keyboard, as we checked MX Keys keyboard is equipped with an ambient light sensor that adapts the keyboard backlight according to the brightness of your room.  \nThere are three default levels that are automatically if you do not toggle the keys:  \n\n\n* If the room is dark, the keyboard will set the backlighting to a low level.\n* In a bright environment, it will adjust to a high level of backlighting to add more contrast to your environment.\n* When the room is too bright, over 200 lux, the backlighting will turn off as the contrast is no longer visible, and it won’t drain your battery unnecessarily.\n\nWhen you leave your keyboard but keep it on, the keyboard detects when your hands approach and it will turn the backlight back on. The backlighting won’t turn back on if:  \n\n\n* Your keyboard has no more battery, below 10%.\n* If the environment you're in is too bright.\n* If you've turned it off manually or using Logitech Options software.\n\nHence the backlight will remain on as long as it is detecting your hand on it. but will adjust on the light on your work area. \n\n  \nThank you for understanding. Please let us know if you have some inquiries.",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "Alphazulu54",
            "body": "one year latter same issue but now i know to tape the sensor",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "danieldangler",
            "body": "I have posted a feature request in the Logitech Center. There are already several on this topic, but they are not really highly voted. Maybe it will help if you vote my post: https://support.logi.com/hc/de/community/posts/4417971999127-Implement-an-option-to-turn-on-the-backlighting-on-the-Logitech-MX-Keys-permanently",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Unely",
            "body": "Can we please get a slider to customize the duration of the backlight that maxes out at \"always on\" ? Just put a warning when enabling \"always on\" that this will drain the battery much faster when not plugged in or something and everyone is happy.   \n\n\nI'm definitely not please with the default duration.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "MonzonShotgun",
            "body": "I've thought that it was possible to keep the backlight ON the whole time when I've bought it yesterday, but nope. A really silly mistake, but more than probably it's due to Logitech chossing some shitty battery. \n\nAlso it not allways work fast when approaching my hand so that adds an extra issue.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "nurbas_",
            "body": "I received the keyboard this morning and it hasn't been 12 hours that I've already had to ask for a refund. It is unacceptable that it has been a year since OP published and they are still waiting for an update of the most basic! The waiting time for the backlight is unjustifiable, 0 empathy with their users.First and last time I invest in one of their products, too bad the mx master 3 looked promising.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "Strong_Pick_8577",
            "body": "dude at this point fuck logi",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "SnooDrawings8803",
            "body": "Pls logi",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "NatesEscape",
            "body": "Yeah I hate this, things like this turn me away from Logitech",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "jwayers",
            "body": "fix this please!!",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "zajay",
            "body": "This is quite frustrating, please fix Logitech. You guys are better than this!",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "fghalex",
            "body": "fix this please!!",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "yazgan_ov",
            "body": "Keyboard's metal frame is capacitive sensor not the keys. When you do this things, software thinks you done with typing and after 3 seconds it turns backlight off\n\n1. Not pressing any buttons while not touching keyboard frame\n2. Not moving your hands close to the keyboard surface to create enough capacitance change that sensor can pick up  \n\n\nTouching the frame with your hand or thumb while temporarily stop typing will keep the backlight on for approximately 30s.  \n\n\nI bought this keyboard yesterday so this is only workaround that I found so far. Yet not able to change the timeout in software is very annoying.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "dijital68",
            "body": "I love everything about the keyboard and mouse, except....you guessed it. The backlighting issues and the  lack of response from Logitech is unacceptable. It's hard to comprehend because overall they are packed with features and are constructed well. Except the LED backlighting. Why Logitech? WHY??? \n\nI can move documents seamlessly across PC's, yet I cant keep the backlighting on. WTH?\n\nIf for some reason (which I highly doubt) it is somehow impossible for the keyboard to stay lit, then Logitech should very simply come out and admit it and explain why. End of story.\n\nOtherwise, PLEASE finish this incomplete product and allow the users control over the backlighting. Oh, and check Active Directory and make sure \"The Team\" still exists....\n\nEdit: A simple firmware update would fix the way the \"Mx keys keyboard is designed differently\" per the Logitech agents response. Everyone knows firmware is just software. It shouldn't be that difficult to edit and update this issue.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "willt263",
            "body": "Well, here's a trick...\n\nThere is a sensor on the upper right/left side of the mx mini keyboard (no 10-key) . If you place an object there, the backlight will stay on for 30+ seconds instead of the usual 5+ seconds.\n\nYour needs may be different than mine, but that's all I need.\n\nhttps://preview.redd.it/jezr2ceo22ga1.jpeg?width=3861&amp;format=pjpg&amp;auto=webp&amp;s=6ad4d961e383eb2abf9f2834543da227a7dca4d4",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Yaldazilla",
            "body": "Logitech, A lot of your customers complain about not having the option of \"Back light always on\". I am a student and I have to take notes for lectures. Having the the back-light turn off automatically is not some much a problem for me, but it is annoying sometimes. The thing that is absolutely frustrating and with out question a flaw, is having the keyboard turn off when the back-light turns off. I have to wait one to two seconds for the keyboard to turn back on so I can type. This results in numerous, countless, relentless, frustration of having to turn on the MX keys than rewinding a lecture video or missing information entirely in class. I want to love your product, but YOU make it difficult.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "SharkReality",
            "body": "2024 with your un-asked for Logi Option+ this is still a BIG problem for day to day users. F you Logi!! Never again. It's just 10 lines of code MAX lol lame ass company",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "obsin_97",
            "body": "Plug in the USB C cable to the \"Mx Keys\" keyboard and the other end to a USB port in your PC and the light will always stay on. Problem solved for now. Thank me later, it took me ages finding this solution...",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "angwonson",
            "body": "Plug it into a normal USB power supply \\*not\\* your computer, then connect via bluetooth (if you weren't already) then make sure and turn the keyboard off and on just to make sure. Mine stays on all the time now and I don't use logi+ software btw.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Affectionate_Floor35",
            "body": "I pulled my MX Mini out the trash a few days ago because there was a firmware update. \n\nBut this thing is still trash. Backlight shuts off, even before the 30 minute limit.\n\nBattery is always 100% because I leave the thing plugged in 100% of the time.\n\nThis is the most regarded and infuriating keyboard I own. I own several because I have been trying to find a replacement. But they all suck just as much as this one.\n\nJesus effing Christ Logitech, just let me set the backlight to on 100% of the time. I don't need some nanny software or product manager telling me \"it will affect battery life\". OF COURSE IT WILL AFFECT BATTERY LIFE. I AM NOT REGARDED.\n\nI don't care. I just want the backlight to stay on.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "Remote_Inflation7790",
            "body": "Just told my Company not to purchase this keyboard, because of this issue, also telling my friends.\n\nMy company has responded by moving away from Logitech on other peripherals. They agreed that the delay in the backlighting hinders productivity, and that the poor response from Logitech is not satisfactory. My company currently has over 50,000 employees.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "luke10702",
            "body": "Does anyone know where the light sensor is on the Mac MX keyboard?  I'm just trying to have the backlight come on even though I am in a bright environment. \n\nThanks.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Great-Amoeba",
            "body": "got a LOGI keyboard for free from my BRO.... and love it... \n\nBUT man wtf is this BS with the lights, i want lights ON ALL THE TIME!!!\n\nmight buy another brand, no update on this yet, right?",
            "score": 1,
            "sentiment": "mixed"
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Motor-Celery-5292",
            "body": "No resolution, after years. Returning product ASAP",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "[deleted]",
            "body": "Guys, i bought Logitech K380s (aka Pebble Keys) and after some day using, i discovery the MX Key Mini model and i think \"man, i should have bought MX Key Mini, don\\`t K380s). And i start to see some reviews on Youtube and i see a lot people talking about this bad Logitech choice to don\\`t allow backlight always on.\n\nI decided to \"think easy\" and decide to continue with my K380s (i paid 1/3 of price MX Mini Keys, here in Brazil K380s costs about 40 dollars and MX Mini Keys costs 120 dollars). My solution is use a very little lampshade with yellow light, very confortable and i don't need use more any keyboard with backlight.\n\n  \nSo, my sugestion for you guys, is to use a little lampshade and complete disable backlight of this keyboard. Will be very confortable for your eyes.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "EquivalentStock1945",
            "body": "I found an elementary hardware solution to this problem, I provide a link to my detailed comment on this matter with a solution to the problem!  \n[https://www.reddit.com/r/logitech/comments/105esfl/comment/l3ufwbd/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/logitech/comments/105esfl/comment/l3ufwbd/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "rickatk",
            "body": "Have you tried fn (followed by) lightbulb? This seems to work better than fn + light bulb at the same time. My keyboard goes dark as it should.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Leith-42",
            "body": "3 years after OP posted i just bought this $200 paperweight. i need always on backlight. if this isn't resolved before i throw this thing in the trash can, it will be the last logitech product i ever buy",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Consistent-Koala-577",
            "body": "I want the MX Keyboard lights to turn off when my hand is no where near the keyboard.  My lights stay on, and two days later I have to recharge the keyboard again.  I leave it charging most of the time to avoid it from dying so fast. Super whacky and I will be looking to get a different brand.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Least_Cranberry7532",
            "body": "I want to open the eyes of those who still hope that Logitech will fix the problem with the backlight.\n\nThey are not going to do this and never will. Moreover, they deliberately made it so that users without an engineering education and skills in microelectronics would not be able to fix this problem on their own.\n\nAnd there's a reason for that!\n\nWe were charged $150 for a very cheap keyboard, with a short lifespan of LEDs and a microscopic battery. This explains Logitech's stubborn reluctance to meet the wishes of its customers.\n\nIf they release an update that allows you to keep the backlight on all the time - in a few months they will have to face massive returns due to the backlight stopping working and the dead battery.\n\nThey sold us junk at an overprice!\n\nAnd pay attention to how Logitech answers us all here - he speaks to us as if we were mentally retarded, pretending that he does not understand what we are all talking about here in unison. And all this for our money!  \nI know what I’m talking about - I’m from Russia, here Putin talks to the people the same way.\n\nKeep buying Logitech!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Weak-Intention9231",
            "body": "Just got my mx mechanical mini, i absolutly love typing on this, but the fact that the backlight can' stay on is crazy and the fact that logitech knows customers have this issue for years and yet still no solution. that's crazy for a big company like this, debating if i should keep this or return it.. tbf. 🥴",
            "score": 1,
            "sentiment": "mixed"
          },
          {
            "author": "SerguSrG",
            "body": "yep. it's shit. seems easy to fix",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Attjack",
            "body": "I just bought this keyboard (the mini) because I wanted one where the backlighting would stay on, so I'm disappointed that there's no option for that.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "GeorgMaUlWUrf",
            "body": "oh man I am here too now with the exact same problem. nothing has changed.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "weeklypopular",
            "body": "this is the silliest lack of function from Logitech. what is the use of backlight if you have to click a key to turn it on every 10 seconds. its effectively no use for backlight.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "deedaykhaleed",
            "body": "2024 and this issue still hasnt been resolved",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "saint_7677",
            "body": "So, after all is said and done has anyone figured out how to keep the illuminated keyboard illuminated all the time?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "massimilianop",
            "body": "[https://www.reddit.com/r/logitech/comments/105esfl/comment/lt1s4q7/](https://www.reddit.com/r/logitech/comments/105esfl/comment/lt1s4q7/)",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "InterstellarHooman",
            "body": "I have a solution/fix, but it requires a physical 3D printed part (supplied below.)\n\nIt has been years since this keyboard has been released and Logitech clearly doesn't listen to ALL OF US begging for this extremely trivial, simple feature that's this f-ing functional. \\*sigh\\* Whatever.\n\nI asked a friend to make this 3D printed piece, and it does the job. It slides over the F5 \"Blacklight Up\" button. Link \\[here on cad.onshape.com\\](https://cad.onshape.com/documents/6ccd790185e4ad66cba9028f/w/884ed29c31d18b2c0a9c5308/e/5971c23092625a75127da70d?renderMode=0&amp;uiState=67433b5c85d46d09f075064c).\n\nYou shouldn't need an account to export it for printing, but you can save it for editing if you do. There are online printers that will make this for cheap if you don't have a friend with a 3D printer. This fix only takes 10 minutes to print.\n\nInstructions:\n\nTo use the printed clip, make sure the keyboard is on and connected to your device. Press the down \"Backlight button\" (F4) to make sure the light dims. If it doesn't, hold the function key and proceed to the next step. Next, press and hold the \"Backlight Up\" (F5) button. The keyboard's back lighting should go up. Without releasing the key, simply slide the piece over the top of the keyboard and over the button with the long nubbed side on top of the key.\n\nThis fix should not interfere with your typing unless you need the F5 key, in which case, turn on Logi Options+ and remap the keys. Once you're done, close the program entirely in task manager. Because this app is just malware, you need to search for \"Logi\" in the Task Manager and end all 4 tasks belonging to the program. It is otherwise hidden in the system's tasks. While you're here, I would also recommend stopping Logi from turning on during startup by disabling the \"logi\" executable under the \"Startup apps\" tab. If you leave the program running, you will get a useless icon on your screen telling you that the button is pressed.\n\nThe only downside now is that I can't turn down the brightness, but it's worth it. I literally cannot see my keyboard in a pitch black room (DUH Logitech.)\n\nDon't forget to charge during/after each use. Enjoy!\n\nAnyway, hope that significantly improves your quality of life.\n\nPeace!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Nectors",
            "body": "Weighing in my opinion too as I have always valued Logitech and their products very highly. I still can't complain about the hardware, regardless of the product, but in recent years it is noticeable that many extremely stupid decisions regarding the products' firmware and control software. Seriously, they want us to believe that the Yankees landed on the moon with a computer as powerful as a calculator. Now, 56 years later, it is apparently impossible to program a keyboard so that its backlight is constantly lit on this particular model. Come on, you can do better r/logitech 👎🏻",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "ranger052",
            "body": "I just purchased this keyboard for my Mac and I will be returning it. The backlight is a PAIN! Constantly switching off. Hate it.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "TrifleNo5790",
            "body": "Hey all! Guess what! They did it (well way better)!!! I've been begging for this for friggen years and finally it'll stay active for up to 30 minutes!\n\nVersion 73.04.16 on December 10, 2024:\n\nNew features\n\n* This firmware update provides configuration support for the new backlight experience in Logi Options+ (from version 1.85) for your MX Keys Mini.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "_DominoDancing",
            "body": "OMG THEY DID IT",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "V69ROADSTER",
            "body": "Reporting here that my back key is on and on indefinitely after 2 months of owning (hell yes brother)",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "ffsnvm",
            "body": "This is the last Logitech keyboard I've bought. Because of lack of the most basic functionality. I want this thing to be always on. And I'm going to downrate it in a shop where I bought it.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "MyOstadKT",
            "body": "Seriously? Still in 2025? Literally bought the keyboard yesterday after I typed on it for a second in the store. It felt great; what could go wrong!? now I learn you can't leave the fucking backlight on? If you invite me to the repository, I could fix it for ya. 🤣",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Phil_Da_Pill",
            "body": "https://preview.redd.it/k7p4gf8acive1.png?width=1507&amp;format=png&amp;auto=webp&amp;s=2306c74339ce840eee7e88b6c5f08362eaafd89a\n\nUPDATE THE KEYBOARD ON LOGI OPTIONS +!!!!!!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "chikaibeneme",
            "body": "[https://github.com/JollyFrogs/Backlighter](https://github.com/JollyFrogs/Backlighter)\n\nThere you go guys",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "VisibleDriverJ",
            "body": "Can we also have the option to keep the device key light on so I know which laptop the keyboard is connected to",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Affectionate_Floor35",
            "body": "So the \"30 minute\" setting in the app does not work. I got on a conference call, where I needed to login, which required me to type.  At the 8:30 mark while being on the call, the backlight shut off on its own.\n\nTrash.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "LumpyLampy",
            "body": "Just found this thread today. Still not fixed. Logitech still useless.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "pizzadudemike",
            "body": "This drives me nuts!!!!!!!!  I'm sending this back.  My office is dimly lit and I can't see the keys and can't find a way to keep this back light on",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "RetroSwagSauce",
            "body": "I figured out how to do it. With the keyboard always plugged in, use F6/F7 to change the backlight to your preferred brightness (do this at least once, for it to \"update\"), and it should stay there. Tested on Mac with Logi Options software installed using MX Keys Wireless Keyboard. Can't confirm on other systems, but I'd assume it would be the same.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "I just received my MX and this lighting issue is driving me crazy. The only way to keep it lit is by leaving the USB cable plugged in, which defeats the purpose of having a wireless keyboard.\n\nThere is a Youtube video that explains how to disable the ambient sensor but that would mean messing with screws and cables, which is bad on a new product.\n\nI hate it. The keyboard is comfortable but having the light constantly on and off after 3 seconds is horrible.\n\nBad user experience, very bad. This product will be returned to Amazon, sadly.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "OVectorX",
            "body": "Just came to give my feedback, its kinda annoying,  \n\n\nI'm a developer, so its freaking possible, at least the timer set to 30 sec instead of 3 sec would works , give us the option to use it the way we want.  \n\n\nI do not understand Logitech logic, why they are stubborn to update this, is that the engineer who designed that are angry or narcist to refuse to fix this flow in design?!   \n\n\nCome on!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "ha_rsh86",
            "body": "Please add a feature to make the backlight always ON?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "AlienGenetics_",
            "body": "I just bought this keyboard and I'm in the same boat too. This keyboard is great, using this keyboard to program all day the backlight turning off every second is a massive con.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "k0b3rit",
            "body": "\\+1 Please add this feature. i am a developer too, it is very distracting to see as it is always blinking in my peripherical view.\n\nI know you have to sacrifice some battery life, but i think you can enable this option and the user could decide how he/she want to use it.\n\nui:  \nWhy did no one mention this annoying feature/issue with this keyboard in the unboxing videos and reviews? I saw at least 10 different videos but no one mentioned it WHY?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "alienopolis",
            "body": "It is definetely possible and it is also a native setting. Don't know why everyone says that this feature is not available.\n\nDownload [Logitech Options](https://www.logitech.com/it-it/product/options) and install it. Navigate to Keyboard &gt; More Settings &gt; This Device, uncheck \"Disable backlight\" and \"Automatically activate energy saving mode\". The settings name in english should be slightly different since my system language is not english.\n\nIf your battery level is &lt; than 10%, the backlight will always turn off no matter the app settings.In order to keep your backlight on you have to:\n\n* Keep the USB cable connected\n* Charge your keyboard as soon as the battery drops to 10%",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "danieldangler",
            "body": "Yea highly recommended Feature!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "jerahlyn",
            "body": "This thread has been created 1 year ago, has anyone found a solution to this?I purchased this product last month and it really annoys me that the backlight keeps turning off after a few seconds. I really tried to get used to it but 2-3 second timeout makes me feel like I'm at the disco party, not at work.\n\nIt seems like the battery size is big enough to implement this feature... from full charge I was able to use this keyboard for 3 weeks.\n\nI would be more than happy to have the backlight on and charge it every 1-1.5 weeks.\n\nOr at least, please implement an option to increase the timeout to 1-10 minutes (every smartphone has that option), 2-3 seconds by default is ridiculous!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "NaserArab007",
            "body": "I have 100% confidence that Logitech will somehow figure a way to introduce this feature, its a must, the keyboard it self is a magnificent thing, and this is the only feature that keeps it from becoming one of the best keyboards ever.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "ITNiels",
            "body": "I just got this keyboard yesterday, and I too am already missing the always-on feature that the K800 had when it was plugged in..\n\nAdding this as a logit-options.. option would be absolutely incredible! 😊",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "ITNiels",
            "body": "Agree, please fix this!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "[deleted]",
            "body": "Yeah, it’s embarrassing that Logitech cares so little that a major problem this easy to fix has been left this long. What an awful company.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Cmpunmu3",
            "body": "the funny thing is that before buying a backlit keyboard for the first time i couldn't even imagine it would be switching off on it's own! what would be a reason, to save battery? but what if i have fully charget it and want it to stay on?\n\nThis idea of dimming out automatically should have been optional and at least secondary.\n\nHow on earth could you think about skipping \"always on\" option? It's just pacepalm",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "F7_osrs",
            "body": "For the love of GOD please make this possible. Just slap a warning on, hell put it behind 5 warnings if the battery consumption is drastic or battery damage is possible if 'always on', but let US make that choice. This is ridiculous to not let the end user use the product how they want to.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "FirstMud9",
            "body": "Logitech craft while charging - backlight was always on, but mx keys mini not?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "fri98",
            "body": "Does anybody knows if the new mechanical MX Keyboard have the same shitty issue of the auto-turn off backlight?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Alphazulu54",
            "body": "Dang, thanks for letting me know. I found the Anker portable charger (737 power bank) on Amazon it's for laptops so it should work good.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "xtrabet",
            "body": "I am having the total opposite situation: My MX Keys just lost the automatic ON/OFF feature and now it's always on.... This is really drianing the battery and I hate to charge it every week... Oh my glob Logitech you need to let the users be able to make their own choices. Super annoyed.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "stinoven",
            "body": "Still nothing? Logitech is pissing me off",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Helpful-Tie8213",
            "body": "I have such a problem when the MX keyboard is lying on the mouse pad, it has false backlight triggers, it just turns itself on and then turns off, it's very annoying, but if you hit the keyboard a couple of times and then put it on the table without a mat, it works fine.  \nin all likelihood, the sensor for turning on the backlight is a sensor that reacts to the static tension of the body, but since static is present not only in the human body, the keyboard reacts to an outside environment, I think this is a big jamb.  \nalso in this keyboard there is a problem with switching music in the browser with hot keys. these keys only work with PC players, but if you remove the Logitech options driver, these keys work even with music in the browser and even on YouTube! however, with a remote driver, you lose a number of functions. this is another proof that logitech does not want to change anything in its program code.... since I contacted support with this problem more than a year ago",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "big_4_ever",
            "body": "Wherever you purchased your keyboard from, be sure to leave a 1-star review!!! This is the only way we'll have a chance to get them to fix this problem (at least when the keyboard is plugged in, smh)??? We have to hurt their sales, and this is the ONLY way.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Martind_Forlon",
            "body": "Seems this issue is staying forever, tough luck for me this time, will take it as costly lesson. However Logitech lost here another customer. Is sad that quite good hardware is losing all good points due poor software and not caring producer. :(",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "dos101",
            "body": "Count me in for wanting an option to change the duration the backlight stays on, or to just always have it on.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "vgdagpin",
            "body": "I really wish I saw this review before buying this product, what a waste of money",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "tobiasbhn",
            "body": "Not a nice solution but a solution that works: When the keyboard is plugged into the power supply, the light stays on permanently.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Federal_Commercial43",
            "body": "Imagine that you are the photographer who has to take the product photo with the backlight on for the logitech website.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "fthinkamp",
            "body": "Can't believe it still persist. Damn.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "alebom6",
            "body": "Oct 5th 2022 - I was here.  \n\n\nI've just bought this keyboard and the always-on backlight is a big miss!   \nThe continous on-off is very disturbing. Now I need a lamp always on on my desk to avoid to go crazy!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "MaleficentTip6285",
            "body": "Another one joining the LONG list of people who want to be able to adjust the backlighting timeout, or set to always on. \n\nEven more annoying is the backlighting will sometimes cycle on and off when I'm not even near it. Must be those fancy sensors at work? \n\nLogitech, why is this sooooooo hard??  It's a fairly simple request from customers who paid a premium for your keyboard. The WHOLE POINT of the backlighting is to see the keys before we touch them. If the sensors don't pick up a \"reading\" until we're going in to touch the keys, it's already too late.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Important-Act-926",
            "body": "I wish I had seen this before purchasing.  The keyboard should remain lit when it is plugged in.  The auto feature is poorly implemented .  I want to leave it on!!  For all the fancy tech involved the result is pathetic.  I have just ordered a much cheaper cable keyboard.  This is pathetic Logitech.  You have lost me as a loyal customer.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "sml1212",
            "body": "Really need the option to keep the backlight on indefinately whether on battery or usb-cable.\n\nUpdate from Logitech?",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Bud935",
            "body": "Please fix this issue, I bought this keyboard because of the backlight feature. It shuts off continuously and sometimes I need to shake the keyboard to get it to come back on. This could be a great keyboard if you could control the backlight feature to your needs.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "dprice76",
            "body": "Thanks for this thread.  I was going to buy this keyboard, now I won't.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "NoSign6591",
            "body": "User avatar\n\nlevel 4\n\nLogi\\_MX\\_LPAS\n\n·\n\n9 mo. ago\n\nTechnical Advisor\n\nHey u/hunnypuppy,\n\n**The power LED indicator of MX Keys also houses an ambient light sensor.**\n\n·\n\n9 mo. ago\n\nPerfect, that helped a lot.\n\nAlso a note for others, the keyboard light sensor response to changes in lightning isn't instant. It takes about 30 seconds for the changes in lighting to take effect. For example, if going to a brightly lit room, it takes 30 seconds for the keyboard to continually register bright light before turning off the backlights and vice versa.\n\nAlso another tip for users, if you plug in the keyboard and then switch the keyboard power slider off and then on, **the backlight will remain on continuously (as long there the light sensor registers a dark room).** A workaround on how to keep the light on at all times in a dark room.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "massetyrre",
            "body": "I just bought this keyboard, plugged it and it took me about 20 seconds to get frustrated over this issue and another 1h googling, reading and chatting with Logitech support to find out that what I first thought was impossible, is actually a fact: The backlight cannot be turned on permanently. To me, it really came as a shock that it is not possible.\n\nHaving that said, it otherwise feels like a really awesome keyboard.\n\nFor me, this is unfortunately so frustrating that I will most likely return it. Any suggestions what I should buy instead when coding (for a living) using Windows?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "ctatham",
            "body": "Came here loving the keyboard but not being able to understand any of the light logic!!  In fact even entering the room I find it blinking away for no real reason!  I can find a light setting in the new version of options software but nothing other than on or off.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Voo_Du",
            "body": "I have MX Mechanical and the issue is the same. It's driving me crazy. I don't understand what's so hard here that it takes already over 2 years. Especially, since this Logi Options app is getting updates pretty frequently, one of them could actually contain something useful",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "chisha1",
            "body": "Has anyone found a solution?? If not a similar keyboard that actually lets you keep your backlight on? If Logitech doesn't want to do this for us we can't force them",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "SwissRobDog",
            "body": "OMG !\n\nPlease don't tell me that you can't leave the backlight on! This is driving me nuts ! I bought this keyboard as a replacement for my very worn and well-loved Logitech K810, it is very similar. On the K810 if you leave the keyboard cabled then the backlight can be always on. Surely there is a way to have the same function on the MX mini ? I work in a very low light film studio, and it is awful to have the keyboard fading out so quickly then I have to guess a key in the darkness and sometimes it fades out almost immediately after touching. I don't find that the sensor picks my hand up, I have to actually press a key in darkness. Logitech THIS SHOULD BE AN EASY FIX. It needs addressing. Please tell us all when that will happen",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Woop_Pow",
            "body": "Hello,\n\nCan you please help I have the Logitech MX Keys. If I press the F6 and F7 keys I can set the intensity of the backlit including the option to turn it off completely. Problem is that I don't see how to tell the keyboard to leave the backlit always on. It turns the backlit off by itself if you leave it for a period of time without touching it and is very annoying. I check the settings with the Logitech Option+ app and didn't found anything that allows me to set the backlit to always on.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Lora_hubanova",
            "body": "Please, make an option ALWAYS ON!!!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "zeroStackTrace",
            "body": "\"always on\" works as long it is charging",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "shadowdsfire",
            "body": "For those who just bought a keyboard and are searching for this feature, Logitech still hasn't made any changes. It sucks.  But someone pointed out that the proximity sensor isn't based on luminosity level over the keyboard but it is actually a capacity sensor on the metal frame of the keyboard; meaning **touching the sides of the keyboard** works way better than just hovering your hands over the keys.  \n\n\nThat makes it good enough for me. Cheers, enjoy your brand new keyboard.",
            "score": 1,
            "sentiment": "mixed"
          },
          {
            "author": "Equivalent_Twist_977",
            "body": "I love the keyboard, but this is driving me nuts, i am learning to keep my finger on the edge of the keyboard so the backlight doesnt turn off on me... and there is nothing we can do about it. I see so many posts from even two years ago\nNext time i doubt i will be buying a logitech keyboard.\nSo many features and not adding a disable function is realy realy dumb.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "WhosShouting",
            "body": "Gotta tell you, u/logi_sd, I've been using Logitech products for over 30 years and selling them as a reseller for over 20, and this gives me pause.  Two years to (not) implement such a basic feature?  Your support has never been stellar, but just blowing off your customers like this is a really bad look.\n\nTo get your started, here's the backlight user options that you need for the feature:\n\n* Backlight always on \n* Turn off backlight after \\_\\_\\_ seconds\n*  Dim backlight to lowest level after \\_\\_\\_ seconds, then turn off after \\_\\_\\_ additional seconds\n\nWhile you're in there mucking around, if would be nice to be able to disable the Windows Lock key in the top right corner, or force it to be Fn + Lock\\_Key, to prevent accidentally locking the computer while using the numpad.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Mammoth_Statement_53",
            "body": " I used a piece off paper to keep te light button pressed @ all the time. Now the backlight stays on. U have to uninstall loggi options. Because else you get a message on your display.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Ok-Possibility1422",
            "body": "I thought I must have been missing something after getting this for Christmas, but apparently not.. WHY can't I just have the backlight stay on? Seriously, I can't even begin to imagine what they were thinking. The sensor is a novelty, sure, but being able to just manually adjust the backlight settings would be preferable in pretty much every circumstance. I'd also love to be able to adjust the colour of the backlight along the lines of how I adjust the lights for my G502 mouse, but let's not get crazy here...",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Western-Mud-4155",
            "body": "I found the light sensor is on the indicator light light pipe on the top right of the keyboard. So I covered this with a piece of electrical tape. My bright room should never prevent the backlight from coming on. I also disabled the setting to keep backlight off under 10% battery. The last thing is the proximity sensor.\n\nThe proximity sensor proved to be a big challenge. I discovered that the proximity sensor is an inductive proximity sensor consisting of a wire wrapped around the perimeter of the keyboard. This sensor will sense when conductive objects such as hands are nearby. Unfortunately, it has been programmed that even if a conductive object is resting on the keyboard, if it is motionless the backlight will turn off to save battery. You can see this effect by resting your hands on the keyboard, and the lights will turn off after about 30 seconds without motion. So this sensor cannot be tricked just by resting a metal object on the keyboard. I read online that someone inserted a 50 ohm resistor which resulted in always on, but I can't figure out how to open up my keyboard model YR0082 is very robust, high quality, and well put together. One of the reasons i love it. Besides not even sure the resistor would work. So I admit defeat, i can't figure out how to trick this sensor.\n\nThere are also people online with the opposite problem where the proximity sensor goes off without anything nearby. They've torn their keyboards down to tape over the sensor leads. [https://youtu.be/lCIO7L9dPEo](https://youtu.be/lCIO7L9dPEo) When mine starts to fire off randomly like this ill most likely junk it.\n\nLuckily my proximity works pretty well, for now at least. When I need backlight I know how to activate it with the proximity sensor. I know i will get 30 seconds of light. I would prefer to just press \"shift\" and get 30 seconds on light; however keypresses only seem to give 5 seconds of light, even if you press they key and continue to rest your hand on the keyboard you only get 5 seconds. If the light goes off and you still need it you pretty much have to remove your hands completely from the keyboard and then put them back on and wait for the proximity sensor to turn the light on before you press a key, so you get 30 seconds instead of just 5.\n\nEdit: all of above was done on battery power. Later I was relieved to discover if you plug it in a key press will give you 5 minutes of light. ill be using it this way as much as possible. Pressing 'shift' to get 5 minutes of light. I might add some white tape to shift key to make it easier to see at night. Strangely the proximity sensor does not work at all on wired power so the only way to get the light back on is with a keypress, this isnt really an issue anyway as keypress is my preferred method. I just press shift and i am good to start typing. \n\nWish Logitech could push an update to make always on / always off a setting in the control panel. But I am painfully aware that i am replying to a 2 year old thread. At the very least for future models there should be a manual on / off option for the backlight. It is sad because I love their mechanical build quality and typing feel, but I won't be purchasing anymore logitech keyboards.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Kandumand",
            "body": "I found a solution: The way to keep backlights on is keeping your hands on the keyboard forever, the lights will be on forever while you don't move your hands out of the keyboard. \n\n&amp;#x200B;\n\nIf your ear itches, you can do it with one hand while the other keeps the backlight on, for a cup of coffee you can still hold the cup with one hand, if they call your mobile phone the trick also works, the only problem I have not found a solution is when you have to write a text message on your mobile, maybe you can apply some other limb of your body on the keyboard while you do it, I am still studying it.\n\nPD: I bought the keyboard yesterday, before reading this post. I return it to Amazon and one star.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Expert_Restaurant_70",
            "body": "i bought it and i believe i will return it this week. backlight just keep going on and off as it pleases.... without me touching it, just by the keyboard staying on the desk in the same light conditions. a piece of s\\*\\*\\*",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "sentiment": "neutral"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/kpgq7n/mx_keys_backlight_always_on/"
    },
    {
      "postInfo": {
        "title": "MX Master 3s vs MX Master 3s for Mac Difference?",
        "content": "Other than paying the same price for no usb dongle, what advantage does the \"mac\" version have?\n\nSeems limiting, like paying same for less?",
        "author": "rickhouse",
        "score": 132,
        "comments": [
          {
            "author": "kopfzirkus",
            "body": "**TL;DR**\n\nFor anyone finding it now:\n\n**Mac version:** no dongle &amp; USB-C to USB-C cable\n**Normal version:** Logi Bolt dongle and USB-C to USB-A cable\n\nSo go for the normal version (with the dongle) which could be helpful in case of bluetooth lag issues.",
            "score": 25,
            "sentiment": "neutral"
          },
          {
            "author": "Dry_Psychology1469",
            "body": "i don’t actually experience lag connecting to my m1 max. probably because i’m using steermouse instead of the crappy options+",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "Prigatactiv12",
            "body": "Can I buy the non-mac version (with the dongle) and still use gestures on the Mac ?",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Safe_Supermarket_883",
            "body": "i have been using both WIN and MAC mouse for more than 3 months. WIN mouse came with dongle. MAC mouse came without dongle. They both can be connected via Bluetooth without dongle to my WIN machines.  \nThe only difference i noticed is the vertical scroll - on Mac mouse it clicks when I rotate the wheel. On win mouse it does not click when i rotate it. I like Mac mouse for that reason much more. However its personal.  \nhowever I have a question - is my WIN mouse faulty? should the wheel be clicking when I spin it?",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "Vatak88",
            "body": "Is 3s compatible with new macOS Sonoma? Both normal 3s and mac 3s. Tx",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "GregZoneNZ",
            "body": "So frustrating that Logitech can't answer the simple question!  Are these two mouse fuunctionally the same?\n\nI have a Mac, but I specifically don't want a white mouse!\n\nIf I buy the regular MX Master 3s does it function exactly the same as the MX Master 3s for Mac, or is the firmware different so that it functions differently with the Mac?  Is it somehow more optimsed for the Mac (and if so, in what way? Specifically!).\n\nGetting an answer for this out of Logitech seems to be like geting blood out of a stone!  Talk about trying to confuse the customer and stifle sales!",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "untitled112",
            "body": "I bought an mx master 3s for Mac but got the Windows version. It worked the same, but there were no bluetooth issues",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "merve04",
            "body": "I bought the Mx 3s for Mac for $86CAD. Normal Mx 3s is $130CAD, worth the saving for lack of dongle. I use it with my M2 mini, works fine.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Flaky-Difficulty-472",
            "body": "I think its just a marketing thing people say so you feel exclusive (kinda like the whole Apple ecosystem vibe). You pay for “exclusivity” (though sometimes its just nonsense). Also to grab money.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "barnoldswick",
            "body": "Is the Mac version compatible with Logi Bolt dongle? The Mac version is on discount in my local store. I’m going to buy MX Mechanical also, since the keyboard already comes with the Logi Bolt receiver and I believe it should support connecting two devices.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "manyu1979",
            "body": "I had a Bolt Receiver from the past, and just paired it to my Mac 3s model and connection is so much smoother with faster response!  I hated the connection on Bluetooth for my mac as it's choppy and completely stutters at times when other bluetooth connections are being used at the same time.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "akryvtsun",
            "body": "Here is a good review of both  \n[https://youtu.be/gekFDWTWzEc?si=ckKkH4DzlWLjzIOc](https://youtu.be/gekFDWTWzEc?si=ckKkH4DzlWLjzIOc)",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Dear_Spirit2169",
            "body": "I fixed my lag issues by plugging the dongle into a USB A to C Apple adapter and plugging it straight into the MacBook's thunderbolt port.  It was connected to a small hub before and must not have had enough power being it was sharing power with a Yeti mic, web camera and another dongle.  Used the app to fix the natural to normal scroll and set sensitivities and seems to be working ok",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "online-usr",
            "body": "I felt the white one had a better grip than the black one. I used a white colored MX 3S for about 3 years and I bought a black one because the white one looks so dirty now (yellowish).",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "BroadAd6448",
            "body": "Logitech mx 3s vs 2s",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Few-Contribution3791",
            "body": "I bought the Logitech MX Master 3S. I use both a PC and MAC. I installed everything fine on the PC no issues. I was able to program the buttons all good. I then proceed to install it on my MAC. The bluetooth connectivity was easy to add the mouse. The issues I am having is that I installed the Logi Options+ program and my mouse doesn't show up to set the buttons up. I can't seem to figure out what the issue is.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "Hello u/rickhouse,\n\nThank you for reaching out. Please check out the below comparison link for more details.  \n\r  \n[https://www.logitech.com/compare.html?category=products:mice&amp;products=mice:mx-master-3s,mice:mx-master-3s-mac-bluetooth-mouse](https://www.logitech.com/compare.html?category=products:mice&amp;products=mice:mx-master-3s,mice:mx-master-3s-mac-bluetooth-mouse)  \n\n\nLet us know if you have other questions.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "smaak47",
            "body": "I think it's just a marketing thing, because some of the keyboards they have that are made for Mac OS are white, so the white mouse goes better with it. \n\nI have the white master 3s, use it on windows, best mouse I have ever used. I have it in white because I like the look better, and it works perfectly well on windows. \n\nSo I really think it's just a marketing thing. \n\nBlack/grey = windows\nWhite/chrome = Mac. \n\nWhatever colour you choose, you won't regret the master 3s. Amazing mouse. I used to have a \"regular\" mouse and would end up with pain in my wrists and fingers at the end of the day. This one has completely removed the issue, no pain at all. The silent click is amazing, the side scroll wheel makes me a lot faster across spreadsheets, and I use the extra buttons all the time (for copy and paste). \n\nCan't see myself using any other mouse, even though it was expensive!",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "HotAd3488",
            "body": "If you Mac is M1 Max does not do it. I bought both, both do not work properly there is an insane leg on the mouse and it seems that the pointer is moving along a grid instead of a smooth traveling.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "grovolis",
            "body": "Which one did you end up getting? \n\nI have the white version of the regular MX Master 3s, any difference visually with the Mac version? In terms of functionality, I know there is none.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "MrFavorable",
            "body": "So I have a PC for gaming, and I use my wife’s MacBook Pro for school work since it’s portable. Would it make more sense to get the non Mac version if it’s compatible with both? I’d like to be able to use this mouse for both my PC and the MacBook.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "skylar_battles",
            "body": "Both versions are compatible with the Logi Bolt receiver, but only the non-Mac version comes with it in the box, so it feels like with the Mac version the value isn't as good by $15.\n\nAs for the color options:\n\nPale Grey: this color choice is identical on Mac and non-Mac version\n\nBlack : only available for non-Mac option - both scroll wheels are silver and the rest is black\n\nGraphite: only available for non-Mac option - same design scheme as Black listed above but just a lighter hue\n\nSpace Grey: seems like the same color as the Black non-Mac version, but also includes silver around the perimeter and bottom that follows the Pale Grey design scheme found for both Mac and non-Mac versions",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Clean-Shallot6895",
            "body": "&amp;#x200B;\n\nI'll better have an extra type-c to type-c cable then extra Logi dongle, which I have like 3 extras  \n\n\nBut me personaly using my favorite MX Master 2S (normal) with my M2 Pro... And it works just perfect for me. You can still charge your mouse from the wall outlet when not doing any job with it, battery lasts really long  \n\n\nUsing it mostly for Photoshop. What do you guys using mouse with mackbook for?",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "MarqueIV",
            "body": "Get the Mac version for the appearance only. You basically get the dongle for free when you buy other bolt compatible devices anyway.  And if you don’t care about the appearance, get the one with the receiver. Why not? Internal wise, they are identical.\n\nIn my case, I much preferred the white Mac version’s color. I also use my 3S over Bluetooth on my MacBook Pro M1 Max and I really don’t notice any difference between that and using the dongle. Zero lag.\n\nHonestly, the only reason these days that you need a dongle is if you’re using a KVM, or as others have said, are connecting the receiver to a monitor or docking station. Anything that you switch between multiple computers which you connect via wires (again, similar to a KVM.)",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Confident-Fan4003",
            "body": "Hello Guys,\n\nSo I was wondering the same, but there are 3 main differences btwn the mac and the regular, first is color, 2nd is connectivity and the third is, the Mac version has a more soft and quieter click, you can defenitly hear the difference btwn both when you click. other than that same mouse.",
            "score": 1,
            "sentiment": "neutral"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/xqx39g/mx_master_3s_vs_mx_master_3s_for_mac_difference/"
    },
    {
      "postInfo": {
        "title": "Does anyone have any long term experience with the Logitech MX Keys? How has it held up?",
        "content": " \n\nHey y'all,\n\nAbout a week ago I purchased the Logitech MX keys from my local Best Buy for $149CDN (\\~$170 w/tax). They have a 30 day return policy and I'm debating whether I should keep this keyboard or not. Prior to this I've been using a standard Dell wired membrane keyboard for over a decade and it's been bulletproof. However, as I'm changing my setup, I figured it was finally time to retire the old faithful Dell keyboard and upgrade to something more premium.\n\nI'm really loving the typing feel on this keyboard, and the wireless is a nice little plus, however I have had a few small connection issues depending on which USB port I use for the Logitech Unifying Receiver, but I think I've been able to sort that out.\n\nI was wondering if anyone else has experience with this keyboard long term, and could give me some insight as to how it's held up over the years you've owned it; and whether I should keep this, or return it and invest in a mechanical keyboard instead?\n\nDurability/ reliability/ longevity and reparability are at the very top of my list, along with obviously typing feel as well. Has this keyboard been reliable for you? I've never spent this much on a keyboard before, and spending this amount of money on a keyboard is quite an investment for me, so I want to make sure that I'm getting the best value and quality for my money.\n\nI'd love to hear anyone's experiences with this keyboard long term, and it's overall reliability and if you've had any issues with it. Thanks!",
        "author": "CanuckTheClown",
        "score": 21,
        "comments": [
          {
            "author": "SpiritOfTheVoid",
            "body": "I’ve had my Logitech keys soon after it originally came out.  Still in great condition after daily use, good battery life.  Remains one of the most comfortable keyboards I’ve had.  \n\nI use the Unifying dongle.  \n\nI’d love to get the mechanical version, but can’t really justify it, since this one works well.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "chefTechie",
            "body": "I bought my wife the MX Keys (full version) back in March 2021. We both work from home and she goes to school and uses it daily. Windows PC for work and Mac for school. Works great for both. She’s never complained about it. Battery life seems to be good (again, never complained once about it). \n\nShe ended up buying me the MX Keys Mechanical (shirt version) for Christmas and I absolutely love it. If my keyboard is anything like hers, I’m sure I’ll be keeping mine for a long time also.",
            "score": 3,
            "sentiment": "positive"
          },
          {
            "author": "MetaGood",
            "body": "It's a good keyboard but be prepared to **throw it away** after the warranty period.\n\nLogitech will not supply (even for money) spare parts. They will not entertain a discount or a replacement for when your scissor mechanism under a couple of keys breaks. And imho, it's a matter of WHEN not IF.\n\nGet yourself something else. Plenty of great low profile mechanical keyboards now. Avoid Logitech. Reasonable quality but extremely poor customer service. This is not opinion, I have the emails.",
            "score": 3,
            "sentiment": "negative"
          },
          {
            "author": "EndlessDare",
            "body": "6 months of use, has held up pretty well, especially for wireless keyboard. I use Bluetooth.  \nNo connectivity or discernible power issues. Still holds charge for about a week of moderate use with backlight on.  \n\n\nI only use it for one device.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "Cookies_and_Cache",
            "body": "I’ve been using the mx keys for over a year at work and it holds up quite well.\n\nMy biggest complaint, if you could call it that, is that the stroke of the scissor switch is very shallow. \n\nOther than that it’s been a solid experience and a keyboard I’d likely recommend.\n\nWith that said, I’m about to swap it out with a G815 I found an incredible deal on. I’m very much a mechanical keyboard fan and prefer the feel and feedback of those switches.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "Bacon-80",
            "body": "I have a few versions of the mx keys (mechanical large/mini, the regular large/mini, and the Mac versions of both) they’ve stood up well &amp; the only reason I switched from using them was because my new work max is compatible with the apple touch ID keyboard for passwords. So I stopped using them. Loved them while I used them though.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "redrabbitreader",
            "body": "Mine worked really well over a period of about 6 months, but I was a little disappointed in the battery life. I may have ended up with a bad battery though, as I upgraded to a MX Mechanical and the battery is lasting a lot longer.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "CarJunkyXL",
            "body": "For office work, it is great. For competitive gaming,  not so much. Wish they made a “lightning” version.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "toybuilder",
            "body": "The keyboard action itself has been great for years.  The letter E has worn off (maybe I accidentally scratched it?) so there is a slightly annoying bright spot on that key.\n\nThere have been annoying key misdetection issues that have come and gone -- usually with the arrow keys -- like everything else works fine, but some arrow keys would just not work anymore until I turn the keyboard off and on.\n\nI have a PC, so I wish they had the keyboard markings in Windows style (Win key, Alt key).  I also think they should have made the \"calculator\" key the context-menu key by default.  I remapped it in the setup, so not really a problem.\n\nI have had some interference issue between the MX keyboard and MX Master 2S mouse when the receiver is plugged in directly to the laptop -- but the dongle plugged into a hub located at a different place on my desk has been working fine.\n\nVery comfortable to use for me.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "SugarWong",
            "body": "I've been running an MX keys for a while now. its very useful for me and Logitech is one of the best out there for keyboards, I recommend keeping it.\n\nthe USB port you plug into does not really matter.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "yycTechGuy",
            "body": "I've been using my non mechanical MX Keys keyboard daily for 1.5 years.  It is as good as new.\n\nFantastic keyboard.   I love it.\n\nI use it with a unifying receiver.  I love that too.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "freewizard",
            "body": "mac user with mx mini for 6 months, quality is good, the lack of fn/ctrl switch option is annoying",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "sstrads",
            "body": "Bit late, I presume...  \nLooking for info about spare caps since 2 of them broke off, I came across this post, so that's a bad start.  \nMac/Win user with full sized MX Keys, no palm rest, through bluetooth, for more than 2 years now.  \nDon't get me wrong, yes, 2 caps have broke off, but the quality is superb, backlit is still as bright as day 1, proximity sensor however has never worked properly and I think you can find enough evidence on forums that it has a problem, it's not just me. There's a fix but it requires opening the keyboard and I can't be bothered, honestly.  \nI just wish there was a legit and official way to get spare key caps 'cause I don't trust 3rd party sellers.  \nI do recommend you get a silicone cover for yours though, might take a bit to get used to the weird feeling but just think it'll help to preserve it.  \n\n\nGood luck!",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "payne007",
            "body": "Not very durable, and no options for repairs.\n\nRather disappointing, and definitely sad since the kb itself feels good.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "Weaver0fTales",
            "body": "2 years of use and suddenly died, no support from company. Great keyboard while it worked but I'll no longer support Logitech.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "omdbaatar",
            "body": "very late to the game but will say it's frustrating after a couple years to have keys fail: for me it's the left shift and one of the function keys over the number pad. I do carry it around in my backpack though. \n\nAnyone know if the mechanical option would be more robust with this use case?",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "Square_Elephant_5681",
            "body": "If you use it for coding and use F-keys, then this isn't very good since there is no grouping of F-keys. So in Microsoft world where you use F4, F5, F10, F11 and F12 a lot in tools like Visual Studio, you never find the correct F-button without looking.  \n  \nAdditionally the keyboard needs to be recharged very often because if you turn off backlight those F-keys get even harder to find.\n\n  \nOtherwise the typing feel is excellent.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "torbrub",
            "body": "Using MX Keys keyboard here for 2.5 years now. Only issue was encountered recently where the keyboard would not stay connected to a specific laptop. It would pair and immediately drop connection. \n\nOne user suggested unpairing both the M720 Triathlon mouse and the keyboard, then re-pairing the keyboard first, then the mouse. This worked and has been great since. \n\nThis keyboard doesn’t leave a home office, so it has held up well. 2 users.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "liskeeksil",
            "body": "I bought a logitech k360 for 20$ at walmart in like 2019 and have been using it every day as a daily driver since I work from home full time.\n\nI've been looking to upgrade to mx keys s or maybe mx mechanical but im struggling with some of the reviews on here. People paying 100-120 for a keyboard and having it break after 2 years. Like what????!!!\n\nAll my life I have never had a keyboard/key break. Not sure if you are using your keyboards for shoveling snow or somrthing or if the quality has been so shitty lately.",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "fatfatfattfat",
            "body": "Although I bought a BRAND NEW MX Keys Mini Logi Keyboard about 5 months ago, I'm now desperate for the result. When I was trying to tuck my keyboard into my backpack, it just slipped from my hand through the bag; by reflex, I wanted to keep it, and it randomly positioned my fingers on the ESC key. Then, I noticed that the key was displaced. It seems the key was broken inside with just one tiny nail. When I contacted Logitech, they said that they don't sell the keys separately, and they don't change it as, according to their saying, my insurance is void. Hey Hey! Here, I'm writing from the Earth! What kind of brand does not embrace this kind of fault? Is this your marketing strategy: manufacturing a keyboard with such fragile keys and leaving customers without any option other than buying one more BRAND-NEW one in 6 months?\n\nhttps://preview.redd.it/828dn0y77fte1.jpeg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=aa1083c4f6bcaae9772a95f65623067d38bf6033",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "GooglySIG",
            "body": "I have it mainly switching between two unifying receivers on my work PC and my Mac mini with no issues, and a little bit with Bluetooth pairing with an iPad Pro. I’m used to low profile keyboards so it’s been great. I did order a nuphy air 96 that hasn’t arrived as my first mechanical, but I will probably still use the Mx keys most of the time for work, and the number pad works well as expected.",
            "score": 1,
            "sentiment": "positive"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/10itxgh/does_anyone_have_any_long_term_experience_with/"
    },
    {
      "postInfo": {
        "title": "MX Mechanical long term opinions?",
        "content": "I am considering to pair my Master 3S with wither an MX Keys, MX Mechanical or a custom board. The custom is a bit too expensive to justify, however the MXs sound good. Thing is, I kinda like a mechanical keyboard more than tan the acissor style switches on the MX Keys. Not the problem is I keep on jearing reviewers complain about the quality of the key caps, how they wear out easily and how the spacebar is non standard therefore not replaceable, nor does Logitech sell replacements. \n\nSo here I ask you, owners of the MX Keys or MX Mechanical, how has yours held up over time? I am interested in the Windows version since I will use it eith the receiver on the PC and Bluetooth on mac.",
        "author": "CommunicationEast623",
        "score": 32,
        "comments": [
          {
            "author": "songpooh",
            "body": "Along the lines of my long post here: [https://www.reddit.com/r/logitech/comments/119bscj/pain\\_points\\_regarding\\_logitechs\\_keyboards\\_and/](https://www.reddit.com/r/logitech/comments/119bscj/pain_points_regarding_logitechs_keyboards_and/)\n\nMX Mech is undoubtedly one of the best options in the market right now that's mechanical &amp; low-profile &amp; wireless. I really hope this call for better keycaps get heard by Logitech because neither Keychron nor NuPhy can match Logitech's software capabilities right now (but NuPhy's build quality seems slightly ahead of Logitech).",
            "score": 5,
            "sentiment": "positive"
          },
          {
            "author": "Fiv3Score",
            "body": "I have mine as a backup, since release (full size Mx mech). It’s been great, no issues except that I hate the keycaps. They get oily/shiny so quickly and look terrible. I have to wipe it after each day.\n\nI use a NuPhy mech keyboard as my main, as the typing feel is much better. Would highly suggest as an alternative",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "Logi_VA",
            "body": "Hi u/CommunicationEast623,\n\nThanks for reaching out. \n\nMX keys standard version is compatible with unifying receiver only, the MX keys Business version comes with Bolt receiver. Whereas both Master 3S and MX Mechanical is compatible with Logi Bolt.\n\nThank you for your feedback. We will pass this along to our team. We always want to ensure we are providing our customers with the best products and experience. Let us know if there is anything else in the future we can do to assist.",
            "score": 2,
            "sentiment": "positive"
          },
          {
            "author": "StandardWillingness5",
            "body": "I have MX Keys.  And this ended up being longer than I intended.   Sorry about that!\n\nI've been using it with Windows 10 for almost 2 years with an MX Ergo trackball.  The keyboard does what everything with a matte finish does; it starts to get shiny from oil and abrasion from your fingertips.   No way to prevent it.   There is a screw that has come undone inside the keyboard -- I've never dropped it and all the keys are intact and work properly, yet somehow this has happened.   It's somewhat bothersome because what is a keyboard -- a circuit board.  A metal screw bouncing around on a circuit board means sure death any day now.   Yay, another $100 down the toilet.\n\nALSO -- whoever designed this keyboard obviously never sat at a keyboard and typed for any continual period of time.   Some genius decided to double the width of the Esc key which pushed all of the Function keys an entire key width to the right.   If you are a touch typist (don't look at the keys when you type) this has a profound ability on your production capability.    I've been using a keyboard since DOS -- there are Fkeys that do not usually require me to stop what I'm doing to focus on the keyboard (for instance, renaming a file.   F2 -- i can do it in my sleep.    Well, not anymore because F1 has moved into its normal, where it has lived for 50 years space so that the big fat useless Esc key can have more room.   It makes no sense at all).   Even though it seemed like a useless feature, the small space that broke up the F keys (after every 4 keys) was such an enormous part of being able to hit those keys without having to look for them.    Every F key strike is now an exercise in hunt and peck -- if you hit the wrong function key, it could end up costing you lost data or lost time.\n\nThere is no ability to raise the rear of the keyboard, so you are stuck with whatever height they decided to make it.  For me, it's a little too flat and it throws my typing off.\n\nThe keys themselves have very little \"give\" to them.  If you are a heavy handed typist, this will throw you.   I still haven't quite adjusted to it and I use the thing daily.  It feels to me like I'm typing on a laptop.\n\nThe backlighting -- for some unknown reason -- decides to do it's own light show if the keyboard hasn't been used in a while (totally random amount of time).   If I've turned off the PC but not the keyboard, it will slowly raise the backlighting then slowly fade out -- and will continue to do so until I either turn it off or turn the pc back on.\n\nThe flow function, when it works correctly, is a great addition.   Unfortunately, it is not at all consistent in it's performance.   It also seems to be very quirky about where it's flow-corners are from time to time.   I've experienced an inability to switch to the other screen a number of times ... even purposefully trying to scroll over.   I end up having to hit the button on the keyboard or trackball to manually switch.\n\nThe Logi Options+ software is painfully slow to load.\n\nThe MX series is clearly a big step up for Logitech and overall the series gives your setup a feel that's one step above basic.   Functionally, however, it negatively affects your ability to work in ways you couldn't imagine until you try it yourself.\n\n&amp;#x200B;\n\nPS  Because I'd never heard of it, I just looked up MX Mechanical.   So if I pay $70 more than I paid for the MX, I can have things back the way they used to be -- a regular-size Esc key and separated (by color) function keys.    At least I know I'm not the only one who had problems with their redesign if they changed it back!    But $170?   REALLY?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "BleepingBleeper",
            "body": "For me, the sensor is hit or miss because it takes too long to be able to hit a specific key because the keys sometimes don't light up when I want them too. There should be an option to keep them lit up all of the time. Having to wave my hands over the keyboard in order to see where the keys are is a big negative.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "Wenix",
            "body": "I have the MX Mechanical and I am not satisfied. It is the most expensive keyboard I've ever owned and it is full of flaws.\n\n1. Backlight doesn't turn on when you start typing, sometimes you have wave you hand aggressively over the keyboard to get the backlight to turn on.\n2. The backlight won't turn off. When my laptop goes into sleep mode, the keyboard works normally. But then after 15-30 minutes the backlight suddenly turns on again and stays on until you manually turn off the keyboard.\n3. Sometimes the keyboard just goes mad and sends the wrong characters to the computer. You'll mostly notice this when you can no longer enter your password correctly or when you hit the \"Lock\" button which will just type \"q\" on the screen.\n4. It is sometimes really slow to wake up. It feels like 5-10 seconds where you keep hitting the keys and nothing happens. But I haven't actually timed it.\n\nThe physical keyboard is nice. It feels strong and it is nice to type on. But based on the problems above, I just can't recommend this keyboard. I have considered considered getting something else, but I keep hoping that the next firmware might fix some of the problems, but it never does.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "SnowNeoSoft",
            "body": "Benefit on MX series would be FLOW support. 3 machines for 1 paired mouse and keyboard is very nice.\n\nBut I personally prefer machanical keyboard with gaming layout. I use clicky switch at home and quiet one at office. I feel same and no adjustment required on keyboard.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "Metropolitan89",
            "body": "I have the MX Keys for over a year and really like it. I personally do prefer the short travel of good \"laptop\" keyboards. For the laptop type keyboard it has really stable keys. I like the angle it sits on; But if you don't, it doesn't have adjustable feet.\n\nI use it for several machines and travel with it from home to office 1-2 a week.\n\n(+)\n\n* Comfy to type on. Has stable keys.\n* Backlit with sensor for light.\n* Switching between 3 devices (both Mac and Win keys).\n* Full-size keyboard (in my line numerical keys are useful).\n* Some keys can be remapped.\n* Macro keys\n\n(-)\n\n* Full-size keyboard - almost too big to travel with. 43cm wide. It is wider than 15\" ThinkPad. I got a separate case just for it.\n* It is quite heavy for traveling. But it's ok while using, even on lap.\n* When backlit it goes thru battery a lot quicker. When you mostly use it during light hours it lasts good time. If you mostly use it during evening/night it does make a big difference. But it charges quick and you can use it while charging.\n* A screw went loose inside and it rattles a bit while being moved, but screws are under glued pads and I don't want to mess with them.",
            "score": 1,
            "sentiment": "positive"
          },
          {
            "author": "yukeake",
            "body": "I have the MX Mechanical Mini, and my wife has the full-size version.  They're good workhorse boards, but could be better. \n\nThe keycaps appear to be made of ABS, which in and of itself isn't a bad thing, but they will gain a shine over time with normal use. This wouldn't be an issue if you could retrofit it with \"standard\" low-profile keycaps, but due to non-standard stabilizer placement, that's not completely possible. (The Nuphy ones *might* work - they work on the Keychron K3, which also has odd stabilizer placement)\n\nThe tactile switches are relatively light, and most similar to Browns, which are quite common. I'd love to replace them with something a bit heavier, but alas, the switches aren't hot-swappable. You're stuck with whatever you initially get. \n\nThis also means that in order to lube the switches you'd need to desolder them, which is a huge pain.  It would really benefit from lubing at least the springs, as they're quite \"pingy\".\n\nNo complaints about the Bluetooth performance so far. It's at least stronger than my Keychrons in that regard.\n\nThe \"Bolt\" dongle likewise seems to be pretty solid, and is a good alternative for times where Bluetooth isn't an option.\n\nBattery life is good.  No complaints.  Only need to charge it every couple of weeks if I'm using it with the backlight on.  It'll probably last a lot longer in an environment where you can leave it off.\n\nAs I said, they're good boards, but there's a lot of areas Logitech could improve them. The price is a bit steep in comparison to entry-level mechanicals that have more room for customization, but if you're looking for something that just works out-of-the-box, you can do a lot worse.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Unable-Character6435",
            "body": "TLDR: MX Кеys S is using recycled plastic.\n\nLogitech, as every other company, has to lower carbon footprint but mistakes were made. \n\nMX products from 2022 introduced recycled plastic as part of their Sustainability program. Тhe worst is MX Mechanical line-up with ~50% while MX Keys S and Mini has ~25% recycled plastic (Graphite, Pare Gray has much better ratio which is hopefully not affecting keycaps). MX Master 3/S are also total waste of money. \n\nMX Keys Mac edition is maybe the only one close to quallity of the original MX Keys (2019). \n\nGood news is that you can spot these inferior products by checking under Specs &amp; Details -&gt; Sustainability on the respectable product page.\n\nPS No, Backlight issue was not 100% solved and with the new grey text paint its hard to use MX Keys S without the backlight enabled.",
            "score": 1,
            "sentiment": "negative"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/11d9m21/mx_mechanical_long_term_opinions/"
    },
    {
      "postInfo": {
        "title": "Received Review copy of MX Keys S, AMA",
        "content": "Disclaimer - I am a compensated reviewer working with Best Buy (get to keep the stuff in exchange for review). Since the MX Keys S product listing is out and no NDA was attached to the product, I feel I can discuss it. I’ve had it for about 2 weeks. Let me know what you want to know!",
        "author": "Keyan06",
        "score": 13,
        "comments": [
          {
            "author": "WhoTheFsAlice",
            "body": "What makes it S",
            "score": 3,
            "sentiment": "neutral"
          },
          {
            "author": "freewizard",
            "body": "Can the Fn key send individual key code in Keys S? It's been an issue on mac for mx keys and mini, basically all those apps use Fn+X and double Fn are useless.\n\nBtw just can't believe it takes logi a new hardware to have customizable backlight duration...",
            "score": 3,
            "sentiment": "negative"
          },
          {
            "author": "Revolutionary_Arm363",
            "body": "Thanks.  I love this keyboard! Unfortunately, the del/period key on the numeric pad was sticking and I removed it to clean it and broke it.  It's working but the bottom is flopping.  I've not been able to get Logitech to send me a replacement key.  Any ideas?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "freezeframepls",
            "body": "does it suck like 90% of logitech's products?",
            "score": -2,
            "sentiment": "negative"
          },
          {
            "author": "Jacopo1891",
            "body": "!Remindme 1 week",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "GenuineJakob",
            "body": "How is the color compared to the Logitech Craft, Keys and Keys mini? Readability of the keys without the backlight is important for me; Craft is white text on dark grey, Keys is white text on medium grey, Keys mini ist barely readable with light grey text on medium grey background.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "osoltokurva",
            "body": "Is ambient light sensor still unusable ? \nWhen I bought original Mx keys I was told that backlight brightness will automatically adjust or turn off according to ambient light. \nThat feature is working only with direct sunlight on few summer days for two hours a day lol. \n\nAlso after few months backlight motion sensor is triggering absolutely randomly even without any f motion in the room lol.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "tact1cal_0",
            "body": "This is really my dream keyboard, I wish I can afford it but sadly, No",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "the-stranger06",
            "body": "can you post a screenshot of the backlight duration option?  \nso the differences from the old model are just bolt as the connector and the backlight duration (that's just a software thing), keys mini already has the bolt technology so i hope they just add the backlight option.  \n\n\ncan you post a screenshot of the backlight duration option?  \nso the differences from the old model are just bolt as connector and the backlight duration (that's just a software thing), keys mini already has the bolt technology so i hope they just add the backlight option.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "thetreemugger",
            "body": "MX keys have a longstanding design defect. Tell me if this one does too:\n\nHolding shift and typing letters RG in quick succession will screw up the input and one of those letters will not register. so, try typing **RG** very fast a few times and tell me if they've finally fixed this stupid defect.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "OpenCardiologist",
            "body": "I have the original MX Keys and one of the key (first world problem) frustrations is that the keyboard device buttons only switch the keyboard and not the mouse.  The mouse needs to be turned over and the small device switch button pressed as well.\n\nI don't see any comments about this changing with the MX Keys S.  Is anybody able to confirm that having to switch both devices is still the case?\n\nA part of me hoped that the new Smart Actions functionality in Options+ would allow this to be done, by assigning to another key, but it doesn't look like it's possible.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Fiv3Score",
            "body": "Ordered with a coupon code, but I will likely return it now that I think about it. There’s like no improvements. At least the Master 3S has some noticeable changes",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "[deleted]",
            "body": "All I want is onboard memory macro support to automate a custom string of text. Can it do this? For example, program the F4 key to type out “thefoxrunsfast” when pressed on any of the 3 devices WITHOUT having Options+ installed.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "[deleted]",
            "body": "I owned the MX Keys Business for a while because I wanted the Bolt USB thing, but returned it because I wasn't too happy with the backlight.\n\nCan you force the backlight to stay on with this, or is it limited to 1 minute max?",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "esnuus",
            "body": "Can you test keyboard for n-key rollover? Meaning pressing multiple keys at the same time for typical gaming combinations. Ie Shift + WASD or shift + WASD + GR or X or space, etc combinations. \n\nYou can do the test on following website and it shows all the keys green when you are pressing them together\n\n[https://www.mechanical-keyboard.org/key-rollover-test/](https://www.mechanical-keyboard.org/key-rollover-test/)",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "GundamTenno",
            "body": "1. Can it lock/disable the Windows key?\n2. Have you noticed any ghosting?\n3. How many simultaneous key inputs can it take?\n4. How's the input lag during games?\n5. Any other issues you've encountered after a long term use?\n6. If you had a legion laptop, how similar is the typing experience? if you didn't have a legion laptop please disregard this last question.\n\nThank you",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "J0EG1",
            "body": "I know this is an older thread but wondering if you’ve used it with Linux? \n\nAlso if I read the differences between the old Mx keys and new Mx keys S there is a text to speech or dictation, is that accurate? If so does it work with Bluetooth?",
            "score": 1,
            "sentiment": "neutral"
          }
        ]
      },
      "link": "https://www.reddit.com/r/logitech/comments/13wkaeg/received_review_copy_of_mx_keys_s_ama/"
    },
    {
      "postInfo": {
        "title": "Does MX Keys for Mac work with Windows?",
        "content": "I accidentally bought an MX Keys for Mac, for use with a Windows laptop and a Chromebook. Will it work? (Trying to decide whether to send it back or live with it). Thanks.",
        "author": "tremor_chris",
        "score": 15,
        "comments": [
          {
            "author": "xskizzx",
            "body": "Yup it will.  I’m using the PC version for my work windows PC and my personal MBP.  The only difference is how the keys are labeled and a few other differences.",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "tremor_chris",
            "body": "Update: works fine with Windows laptop, but can't get it to pair with my Pixelbook Go. :(",
            "score": 2,
            "sentiment": "negative"
          },
          {
            "author": "atomicscrap",
            "body": "Yes. As well as the MX Master 3 for Mac. There is literally no difference besides the lack of USB unifying adapter for the Master and the Mac keyboard layout on the Keys",
            "score": 2,
            "sentiment": "neutral"
          },
          {
            "author": "everyonelovesthe",
            "body": "2 months on, due to stock I'm looking at exactly the same issue Mx keys for Mac to use on windows. Can you think if anything to put me off?? Thanks",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "everyonelovesthe",
            "body": "So just some feedback, no problems here @ remained in the same position just not written on the key which is fine and the \\ is top left. \n\nIt's worth checking the region is set correctly for your W10 machine. In my case UK.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Caulibeam",
            "body": "i made the same mistake. the only problem that I'm having  is command key is mapped to the windows button instead of the alt key. kinda driving me crazy on this one. wonder if theres any way to swap it out.",
            "score": 1,
            "sentiment": "negative"
          },
          {
            "author": "mirrorball_knits",
            "body": "How do you get the MX Keys to connect to your PC? I cannot figure it out.",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "Upstairs_Decision_97",
            "body": " Ll",
            "score": 1,
            "sentiment": "neutral"
          },
          {
            "author": "ialwaysbeatmymeat",
            "body": "Does the Mac version have a USB type a or type C connection?",
            "score": 1,
            "sentiment": "neutral"
          }
        ]
      },
      "link": "https://www.reddit.com/r/keyboards/comments/i4w82n/does_mx_keys_for_mac_work_with_windows/"
    }
  ]
}
